Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x22 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_stmt_list   : 0x0
    <10>   DW_AT_low_pc      : 0x8000150
    <14>   DW_AT_high_pc     : 0x800132c
    <18>   DW_AT_name        : (indirect string, offset: 0x0): ../Core/Src/cr4_fft_1024_stm32.s
    <1c>   DW_AT_comp_dir    : (indirect string, offset: 0x21): D:/Root_Folder/temp_program/019_STM32_project/STM32CubeIDE/workspace_1.12.1/RTOS_MPU6050_FFT_1Task/Debug
    <20>   DW_AT_producer    : (indirect string, offset: 0x8a): GNU AS 2.36.1
    <24>   DW_AT_language    : 32769	(MIPS assembler)
  Compilation Unit @ offset 0x26:
   Length:        0x1248 (32-bit)
   Version:       4
   Abbrev Offset: 0x14
   Pointer Size:  4
 <0><31>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <32>   DW_AT_producer    : (indirect string, offset: 0x3ab3e): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <36>   DW_AT_language    : 12	(ANSI C99)
    <37>   DW_AT_name        : (indirect string, offset: 0x61f00): ../Core/Src/freertos.c
    <3b>   DW_AT_comp_dir    : (indirect string, offset: 0x21): D:/Root_Folder/temp_program/019_STM32_project/STM32CubeIDE/workspace_1.12.1/RTOS_MPU6050_FFT_1Task/Debug

    <65>   DW_AT_name        : (indirect string, offset: 0xbe4f): unsigned int
 <1><69>: Abbrev Number: 4 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 8
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x41d70): long long int
 <1><70>: Abbrev Number: 4 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 8
    <72>   DW_AT_encoding    : 4	(float)
    <73>   DW_AT_name        : (indirect string, offset: 0x342f2): long double
 <1><77>: Abbrev Number: 4 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 1
    <79>   DW_AT_encoding    : 6	(signed char)
    <7a>   DW_AT_name        : (indirect string, offset: 0x47e90): signed char
 <1><7e>: Abbrev Number: 3 (DW_TAG_typedef)
    <7f>   DW_AT_name        : (indirect string, offset: 0x29e86): __uint8_t
    <83>   DW_AT_decl_file   : 3
    <84>   DW_AT_decl_line   : 43
    <85>   DW_AT_decl_column : 24
    <86>   DW_AT_type        : <0x8a>
 <1><8a>: Abbrev Number: 4 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 1
    <8c>   DW_AT_encoding    : 8	(unsigned char)
    <8d>   DW_AT_name        : (indirect string, offset: 0x1cfe9): unsigned char
 <1><91>: Abbrev Number: 3 (DW_TAG_typedef)
    <92>   DW_AT_name        : (indirect string, offset: 0x72b19): __int16_t
    <96>   DW_AT_decl_file   : 3
    <97>   DW_AT_decl_line   : 55
    <98>   DW_AT_decl_column : 24
    <99>   DW_AT_type        : <0x9d>
 <1><9d>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e>   DW_AT_byte_size   : 2
    <9f>   DW_AT_encoding    : 5	(signed)
    <a0>   DW_AT_name        : (indirect string, offset: 0x6b347): short int
 <1><a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0x75c58): __uint16_t
    <a9>   DW_AT_decl_file   : 3
    <aa>   DW_AT_decl_line   : 57
    <ab>   DW_AT_decl_column : 25
    <ac>   DW_AT_type        : <0xb0>
 <1><b0>: Abbrev Number: 4 (DW_TAG_base_type)
    <b1>   DW_AT_byte_size   : 2
    <b2>   DW_AT_encoding    : 7	(unsigned)
    <b3>   DW_AT_name        : (indirect string, offset: 0x2ee64): short unsigned int
 <1><b7>: Abbrev Number: 4 (DW_TAG_base_type)
    <b8>   DW_AT_byte_size   : 4
    <b9>   DW_AT_encoding    : 5	(signed)
    <ba>   DW_AT_name        : (indirect string, offset: 0xc4fb): long int
 <1><be>: Abbrev Number: 3 (DW_TAG_typedef)
    <bf>   DW_AT_name        : (indirect string, offset: 0x5ba1a): __uint32_t
    <c3>   DW_AT_decl_file   : 3
    <c4>   DW_AT_decl_line   : 79
    <c5>   DW_AT_decl_column : 25
    <c6>   DW_AT_type        : <0xca>
 <1><ca>: Abbrev Number: 4 (DW_TAG_base_type)
    <cb>   DW_AT_byte_size   : 4
    <cc>   DW_AT_encoding    : 7	(unsigned)
    <cd>   DW_AT_name        : (indirect string, offset: 0x21d0a): long unsigned int
 <1><d1>: Abbrev Number: 4 (DW_TAG_base_type)
    <d2>   DW_AT_byte_size   : 8
    <d3>   DW_AT_encoding    : 7	(unsigned)
    <d4>   DW_AT_name        : (indirect string, offset: 0x1d94b): long long unsigned int
 <1><d8>: Abbrev Number: 3 (DW_TAG_typedef)
    <d9>   DW_AT_name        : (indirect string, offset: 0x29e88): uint8_t
    <dd>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 24
    <df>   DW_AT_decl_column : 19
    <e0>   DW_AT_type        : <0x7e>
 <1><e4>: Abbrev Number: 5 (DW_TAG_const_type)
    <e5>   DW_AT_type        : <0xd8>
 <1><e9>: Abbrev Number: 3 (DW_TAG_typedef)
    <ea>   DW_AT_name        : (indirect string, offset: 0x72b1b): int16_t
    <ee>   DW_AT_decl_file   : 4
    <ef>   DW_AT_decl_line   : 32
    <f0>   DW_AT_decl_column : 19
    <f1>   DW_AT_type        : <0x91>
 <1><f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <f6>   DW_AT_name        : (indirect string, offset: 0x68fde): uint16_t
    <fa>   DW_AT_decl_file   : 4
    <fb>   DW_AT_decl_line   : 36
    <fc>   DW_AT_decl_column : 20
    <fd>   DW_AT_type        : <0xa4>
 <1><101>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <102>   DW_AT_type        : <0xf5>
 <1><106>: Abbrev Number: 3 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0x6894c): uint32_t
    <10b>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 48
    <10d>   DW_AT_decl_column : 20
    <10e>   DW_AT_type        : <0xbe>
 <1><112>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <113>   DW_AT_type        : <0x106>
 <1><117>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <118>   DW_AT_byte_size   : 4
 <1><119>: Abbrev Number: 3 (DW_TAG_typedef)
    <11a>   DW_AT_name        : (indirect string, offset: 0x69296): StackType_t
    <11e>   DW_AT_decl_file   : 5
    <11f>   DW_AT_decl_line   : 55
    <120>   DW_AT_decl_column : 24
    <121>   DW_AT_type        : <0x106>
 <1><125>: Abbrev Number: 3 (DW_TAG_typedef)
    <126>   DW_AT_name        : (indirect string, offset: 0x83de6): UBaseType_t
    <12a>   DW_AT_decl_file   : 5
    <12b>   DW_AT_decl_line   : 57
    <12c>   DW_AT_decl_column : 23
    <12d>   DW_AT_type        : <0xca>
 <1><131>: Abbrev Number: 3 (DW_TAG_typedef)
    <132>   DW_AT_name        : (indirect string, offset: 0x4eef8): TickType_t
    <136>   DW_AT_decl_file   : 5
    <137>   DW_AT_decl_line   : 63
    <138>   DW_AT_decl_column : 19
    <139>   DW_AT_type        : <0x106>
 <1><13d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <13e>   DW_AT_byte_size   : 4
    <13f>   DW_AT_type        : <0xd8>
 <1><143>: Abbrev Number: 9 (DW_TAG_structure_type)
    <144>   DW_AT_name        : (indirect string, offset: 0x787a6): xSTATIC_LIST_ITEM
    <148>   DW_AT_byte_size   : 20
    <149>   DW_AT_decl_file   : 6
    <14a>   DW_AT_decl_line   : 948
    <14c>   DW_AT_decl_column : 8
    <14d>   DW_AT_sibling     : <0x16e>
 <2><151>: Abbrev Number: 10 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x1cff8): xDummy1
    <156>   DW_AT_decl_file   : 6
    <157>   DW_AT_decl_line   : 950
    <159>   DW_AT_decl_column : 13
    <15a>   DW_AT_type        : <0x131>
    <15e>   DW_AT_data_member_location: 0
 <2><15f>: Abbrev Number: 10 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0x33e31): pvDummy2
    <164>   DW_AT_decl_file   : 6
    <165>   DW_AT_decl_line   : 951
    <167>   DW_AT_decl_column : 8
    <168>   DW_AT_type        : <0x16e>
    <16c>   DW_AT_data_member_location: 4
 <2><16d>: Abbrev Number: 0
 <1><16e>: Abbrev Number: 11 (DW_TAG_array_type)
    <16f>   DW_AT_type        : <0x117>
    <173>   DW_AT_sibling     : <0x17e>
 <2><177>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <178>   DW_AT_type        : <0x62>
    <17c>   DW_AT_upper_bound : 3
 <2><17d>: Abbrev Number: 0
 <1><17e>: Abbrev Number: 13 (DW_TAG_typedef)
    <17f>   DW_AT_name        : (indirect string, offset: 0x33fdb): StaticListItem_t
    <183>   DW_AT_decl_file   : 6
    <184>   DW_AT_decl_line   : 953
    <186>   DW_AT_decl_column : 34
    <187>   DW_AT_type        : <0x143>
 <1><18b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <18c>   DW_AT_name        : (indirect string, offset: 0x603df): xSTATIC_TCB
    <190>   DW_AT_byte_size   : 84
    <191>   DW_AT_decl_file   : 6
    <192>   DW_AT_decl_line   : 984
    <194>   DW_AT_decl_column : 16
    <195>   DW_AT_sibling     : <0x218>
 <2><199>: Abbrev Number: 10 (DW_TAG_member)
    <19a>   DW_AT_name        : (indirect string, offset: 0x1cff7): pxDummy1
    <19e>   DW_AT_decl_file   : 6
    <19f>   DW_AT_decl_line   : 986
    <1a1>   DW_AT_decl_column : 11
    <1a2>   DW_AT_type        : <0x117>
    <1a6>   DW_AT_data_member_location: 0
 <2><1a7>: Abbrev Number: 10 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x1b1ad): xDummy3
    <1ac>   DW_AT_decl_file   : 6
    <1ad>   DW_AT_decl_line   : 990
    <1af>   DW_AT_decl_column : 19
    <1b0>   DW_AT_type        : <0x218>
    <1b4>   DW_AT_data_member_location: 4
 <2><1b5>: Abbrev Number: 10 (DW_TAG_member)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x13898): uxDummy5
    <1ba>   DW_AT_decl_file   : 6
    <1bb>   DW_AT_decl_line   : 991
    <1bd>   DW_AT_decl_column : 16
    <1be>   DW_AT_type        : <0x125>
    <1c2>   DW_AT_data_member_location: 44
 <2><1c3>: Abbrev Number: 10 (DW_TAG_member)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x1d01a): pxDummy6
    <1c8>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 992
    <1cb>   DW_AT_decl_column : 11
    <1cc>   DW_AT_type        : <0x117>
    <1d0>   DW_AT_data_member_location: 48
 <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x32b7e): ucDummy7
    <1d6>   DW_AT_decl_file   : 6
    <1d7>   DW_AT_decl_line   : 993
    <1d9>   DW_AT_decl_column : 13
    <1da>   DW_AT_type        : <0x228>
    <1de>   DW_AT_data_member_location: 52
 <2><1df>: Abbrev Number: 10 (DW_TAG_member)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x1f74d): uxDummy12
    <1e4>   DW_AT_decl_file   : 6
    <1e5>   DW_AT_decl_line   : 1004
    <1e7>   DW_AT_decl_column : 16
    <1e8>   DW_AT_type        : <0x238>
    <1ec>   DW_AT_data_member_location: 68
 <2><1ed>: Abbrev Number: 10 (DW_TAG_member)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x14735): ulDummy18
    <1f2>   DW_AT_decl_file   : 6
    <1f3>   DW_AT_decl_line   : 1019
    <1f5>   DW_AT_decl_column : 14
    <1f6>   DW_AT_type        : <0x106>
    <1fa>   DW_AT_data_member_location: 76
 <2><1fb>: Abbrev Number: 10 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0x2c07f): ucDummy19
    <200>   DW_AT_decl_file   : 6
    <201>   DW_AT_decl_line   : 1020
    <203>   DW_AT_decl_column : 13
    <204>   DW_AT_type        : <0xd8>
    <208>   DW_AT_data_member_location: 80
 <2><209>: Abbrev Number: 10 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x81c59): uxDummy20
    <20e>   DW_AT_decl_file   : 6
    <20f>   DW_AT_decl_line   : 1023
    <211>   DW_AT_decl_column : 13
    <212>   DW_AT_type        : <0xd8>
    <216>   DW_AT_data_member_location: 81
 <2><217>: Abbrev Number: 0
 <1><218>: Abbrev Number: 11 (DW_TAG_array_type)
    <219>   DW_AT_type        : <0x17e>
    <21d>   DW_AT_sibling     : <0x228>
 <2><221>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <222>   DW_AT_type        : <0x62>
    <226>   DW_AT_upper_bound : 1
 <2><227>: Abbrev Number: 0
 <1><228>: Abbrev Number: 11 (DW_TAG_array_type)
    <229>   DW_AT_type        : <0xd8>
    <22d>   DW_AT_sibling     : <0x238>
 <2><231>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <232>   DW_AT_type        : <0x62>
    <236>   DW_AT_upper_bound : 15
 <2><237>: Abbrev Number: 0
 <1><238>: Abbrev Number: 11 (DW_TAG_array_type)
    <239>   DW_AT_type        : <0x125>
    <23d>   DW_AT_sibling     : <0x248>
 <2><241>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <242>   DW_AT_type        : <0x62>
    <246>   DW_AT_upper_bound : 1
 <2><247>: Abbrev Number: 0
 <1><248>: Abbrev Number: 13 (DW_TAG_typedef)
    <249>   DW_AT_name        : (indirect string, offset: 0x47024): StaticTask_t
    <24d>   DW_AT_decl_file   : 6
    <24e>   DW_AT_decl_line   : 1030
    <250>   DW_AT_decl_column : 3
    <251>   DW_AT_type        : <0x18b>
 <1><255>: Abbrev Number: 3 (DW_TAG_typedef)
    <256>   DW_AT_name        : (indirect string, offset: 0x7d11d): TaskHandle_t
    <25a>   DW_AT_decl_file   : 7
    <25b>   DW_AT_decl_line   : 61
    <25c>   DW_AT_decl_column : 16
    <25d>   DW_AT_type        : <0x117>
 <1><261>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <262>   DW_AT_byte_size   : 4
    <263>   DW_AT_type        : <0x26e>
 <1><267>: Abbrev Number: 4 (DW_TAG_base_type)
    <268>   DW_AT_byte_size   : 1
    <269>   DW_AT_encoding    : 8	(unsigned char)
    <26a>   DW_AT_name        : (indirect string, offset: 0x2e54a): char
 <1><26e>: Abbrev Number: 5 (DW_TAG_const_type)
    <26f>   DW_AT_type        : <0x267>
 <1><273>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <274>   DW_AT_byte_size   : 4
    <275>   DW_AT_type        : <0x119>
 <1><279>: Abbrev Number: 14 (DW_TAG_structure_type)
    <27a>   DW_AT_byte_size   : 16
    <27b>   DW_AT_decl_file   : 8
    <27c>   DW_AT_decl_line   : 290
    <27e>   DW_AT_decl_column : 9
    <27f>   DW_AT_sibling     : <0x2bc>
 <2><283>: Abbrev Number: 15 (DW_TAG_member)
    <284>   DW_AT_name        : CCR
    <288>   DW_AT_decl_file   : 8
    <289>   DW_AT_decl_line   : 292
    <28b>   DW_AT_decl_column : 17
    <28c>   DW_AT_type        : <0x112>
    <290>   DW_AT_data_member_location: 0
 <2><291>: Abbrev Number: 10 (DW_TAG_member)
    <292>   DW_AT_name        : (indirect string, offset: 0x37ae9): CNDTR
    <296>   DW_AT_decl_file   : 8
    <297>   DW_AT_decl_line   : 293
    <299>   DW_AT_decl_column : 17
    <29a>   DW_AT_type        : <0x112>
    <29e>   DW_AT_data_member_location: 4
 <2><29f>: Abbrev Number: 10 (DW_TAG_member)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x8a196): CPAR
    <2a4>   DW_AT_decl_file   : 8
    <2a5>   DW_AT_decl_line   : 294
    <2a7>   DW_AT_decl_column : 17
    <2a8>   DW_AT_type        : <0x112>
    <2ac>   DW_AT_data_member_location: 8
 <2><2ad>: Abbrev Number: 10 (DW_TAG_member)
    <2ae>   DW_AT_name        : (indirect string, offset: 0x4f548): CMAR
    <2b2>   DW_AT_decl_file   : 8
    <2b3>   DW_AT_decl_line   : 295
    <2b5>   DW_AT_decl_column : 17
    <2b6>   DW_AT_type        : <0x112>
    <2ba>   DW_AT_data_member_location: 12
 <2><2bb>: Abbrev Number: 0
 <1><2bc>: Abbrev Number: 13 (DW_TAG_typedef)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x7548d): DMA_Channel_TypeDef
    <2c1>   DW_AT_decl_file   : 8
    <2c2>   DW_AT_decl_line   : 296
    <2c4>   DW_AT_decl_column : 3
    <2c5>   DW_AT_type        : <0x279>
 <1><2c9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2ca>   DW_AT_byte_size   : 8
    <2cb>   DW_AT_decl_file   : 8
    <2cc>   DW_AT_decl_line   : 298
    <2ce>   DW_AT_decl_column : 9
    <2cf>   DW_AT_sibling     : <0x2f0>
 <2><2d3>: Abbrev Number: 15 (DW_TAG_member)
    <2d4>   DW_AT_name        : ISR
    <2d8>   DW_AT_decl_file   : 8
    <2d9>   DW_AT_decl_line   : 300
    <2db>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0x112>
    <2e0>   DW_AT_data_member_location: 0
 <2><2e1>: Abbrev Number: 10 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x64ffb): IFCR
    <2e6>   DW_AT_decl_file   : 8
    <2e7>   DW_AT_decl_line   : 301
    <2e9>   DW_AT_decl_column : 17
    <2ea>   DW_AT_type        : <0x112>
    <2ee>   DW_AT_data_member_location: 4
 <2><2ef>: Abbrev Number: 0
 <1><2f0>: Abbrev Number: 13 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x3432e): DMA_TypeDef
    <2f5>   DW_AT_decl_file   : 8
    <2f6>   DW_AT_decl_line   : 302
    <2f8>   DW_AT_decl_column : 3
    <2f9>   DW_AT_type        : <0x2c9>
 <1><2fd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2fe>   DW_AT_byte_size   : 36
    <2ff>   DW_AT_decl_file   : 8
    <300>   DW_AT_decl_line   : 384
    <302>   DW_AT_decl_column : 9
    <303>   DW_AT_sibling     : <0x385>
 <2><307>: Abbrev Number: 15 (DW_TAG_member)
    <308>   DW_AT_name        : CR1
    <30c>   DW_AT_decl_file   : 8
    <30d>   DW_AT_decl_line   : 386
    <30f>   DW_AT_decl_column : 17
    <310>   DW_AT_type        : <0x112>
    <314>   DW_AT_data_member_location: 0
 <2><315>: Abbrev Number: 15 (DW_TAG_member)
    <316>   DW_AT_name        : CR2
    <31a>   DW_AT_decl_file   : 8
    <31b>   DW_AT_decl_line   : 387
    <31d>   DW_AT_decl_column : 17
    <31e>   DW_AT_type        : <0x112>
    <322>   DW_AT_data_member_location: 4
 <2><323>: Abbrev Number: 10 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x14eba): OAR1
    <328>   DW_AT_decl_file   : 8
    <329>   DW_AT_decl_line   : 388
    <32b>   DW_AT_decl_column : 17
    <32c>   DW_AT_type        : <0x112>
    <330>   DW_AT_data_member_location: 8
 <2><331>: Abbrev Number: 10 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x28f47): OAR2
    <336>   DW_AT_decl_file   : 8
    <337>   DW_AT_decl_line   : 389
    <339>   DW_AT_decl_column : 17
    <33a>   DW_AT_type        : <0x112>
    <33e>   DW_AT_data_member_location: 12
 <2><33f>: Abbrev Number: 15 (DW_TAG_member)
    <340>   DW_AT_name        : DR
    <343>   DW_AT_decl_file   : 8
    <344>   DW_AT_decl_line   : 390
    <346>   DW_AT_decl_column : 17
    <347>   DW_AT_type        : <0x112>
    <34b>   DW_AT_data_member_location: 16
 <2><34c>: Abbrev Number: 15 (DW_TAG_member)
    <34d>   DW_AT_name        : SR1
    <351>   DW_AT_decl_file   : 8
    <352>   DW_AT_decl_line   : 391
    <354>   DW_AT_decl_column : 17
    <355>   DW_AT_type        : <0x112>
    <359>   DW_AT_data_member_location: 20
 <2><35a>: Abbrev Number: 15 (DW_TAG_member)
    <35b>   DW_AT_name        : SR2
    <35f>   DW_AT_decl_file   : 8
    <360>   DW_AT_decl_line   : 392
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x112>
    <367>   DW_AT_data_member_location: 24
 <2><368>: Abbrev Number: 15 (DW_TAG_member)
    <369>   DW_AT_name        : CCR
    <36d>   DW_AT_decl_file   : 8
    <36e>   DW_AT_decl_line   : 393
    <370>   DW_AT_decl_column : 17
    <371>   DW_AT_type        : <0x112>
    <375>   DW_AT_data_member_location: 28
 <2><376>: Abbrev Number: 10 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x49959): TRISE
    <37b>   DW_AT_decl_file   : 8
    <37c>   DW_AT_decl_line   : 394
    <37e>   DW_AT_decl_column : 17
    <37f>   DW_AT_type        : <0x112>
    <383>   DW_AT_data_member_location: 32
 <2><384>: Abbrev Number: 0
 <1><385>: Abbrev Number: 13 (DW_TAG_typedef)
    <386>   DW_AT_name        : (indirect string, offset: 0x71a9d): I2C_TypeDef
    <38a>   DW_AT_decl_file   : 8
    <38b>   DW_AT_decl_line   : 395
    <38d>   DW_AT_decl_column : 3
    <38e>   DW_AT_type        : <0x2fd>
 <1><392>: Abbrev Number: 14 (DW_TAG_structure_type)
    <393>   DW_AT_byte_size   : 28
    <394>   DW_AT_decl_file   : 8
    <395>   DW_AT_decl_line   : 506
    <397>   DW_AT_decl_column : 9
    <398>   DW_AT_sibling     : <0x3fd>
 <2><39c>: Abbrev Number: 15 (DW_TAG_member)
    <39d>   DW_AT_name        : SR
    <3a0>   DW_AT_decl_file   : 8
    <3a1>   DW_AT_decl_line   : 508
    <3a3>   DW_AT_decl_column : 17
    <3a4>   DW_AT_type        : <0x112>
    <3a8>   DW_AT_data_member_location: 0
 <2><3a9>: Abbrev Number: 15 (DW_TAG_member)
    <3aa>   DW_AT_name        : DR
    <3ad>   DW_AT_decl_file   : 8
    <3ae>   DW_AT_decl_line   : 509
    <3b0>   DW_AT_decl_column : 17
    <3b1>   DW_AT_type        : <0x112>
    <3b5>   DW_AT_data_member_location: 4
 <2><3b6>: Abbrev Number: 15 (DW_TAG_member)
    <3b7>   DW_AT_name        : BRR
    <3bb>   DW_AT_decl_file   : 8
    <3bc>   DW_AT_decl_line   : 510
    <3be>   DW_AT_decl_column : 17
    <3bf>   DW_AT_type        : <0x112>
    <3c3>   DW_AT_data_member_location: 8
 <2><3c4>: Abbrev Number: 15 (DW_TAG_member)
    <3c5>   DW_AT_name        : CR1
    <3c9>   DW_AT_decl_file   : 8
    <3ca>   DW_AT_decl_line   : 511
    <3cc>   DW_AT_decl_column : 17
    <3cd>   DW_AT_type        : <0x112>
    <3d1>   DW_AT_data_member_location: 12
 <2><3d2>: Abbrev Number: 15 (DW_TAG_member)
    <3d3>   DW_AT_name        : CR2
    <3d7>   DW_AT_decl_file   : 8
    <3d8>   DW_AT_decl_line   : 512
    <3da>   DW_AT_decl_column : 17
    <3db>   DW_AT_type        : <0x112>
    <3df>   DW_AT_data_member_location: 16
 <2><3e0>: Abbrev Number: 15 (DW_TAG_member)
    <3e1>   DW_AT_name        : CR3
    <3e5>   DW_AT_decl_file   : 8
    <3e6>   DW_AT_decl_line   : 513
    <3e8>   DW_AT_decl_column : 17
    <3e9>   DW_AT_type        : <0x112>
    <3ed>   DW_AT_data_member_location: 20
 <2><3ee>: Abbrev Number: 10 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x27c18): GTPR
    <3f3>   DW_AT_decl_file   : 8
    <3f4>   DW_AT_decl_line   : 514
    <3f6>   DW_AT_decl_column : 17
    <3f7>   DW_AT_type        : <0x112>
    <3fb>   DW_AT_data_member_location: 24
 <2><3fc>: Abbrev Number: 0
 <1><3fd>: Abbrev Number: 13 (DW_TAG_typedef)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x8dbb3): USART_TypeDef
    <402>   DW_AT_decl_file   : 8
    <403>   DW_AT_decl_line   : 515
    <405>   DW_AT_decl_column : 3
    <406>   DW_AT_type        : <0x392>
 <1><40a>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <40b>   DW_AT_encoding    : 7	(unsigned)
    <40c>   DW_AT_byte_size   : 1
    <40d>   DW_AT_type        : <0x8a>
    <411>   DW_AT_decl_file   : 9
    <412>   DW_AT_decl_line   : 39
    <413>   DW_AT_decl_column : 1
    <414>   DW_AT_sibling     : <0x431>
 <2><418>: Abbrev Number: 17 (DW_TAG_enumerator)
    <419>   DW_AT_name        : (indirect string, offset: 0x305d2): HAL_OK
    <41d>   DW_AT_const_value : 0
 <2><41e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <41f>   DW_AT_name        : (indirect string, offset: 0x59f2e): HAL_ERROR
    <423>   DW_AT_const_value : 1
 <2><424>: Abbrev Number: 17 (DW_TAG_enumerator)
    <425>   DW_AT_name        : (indirect string, offset: 0x18d1e): HAL_BUSY
    <429>   DW_AT_const_value : 2
 <2><42a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <42b>   DW_AT_name        : (indirect string, offset: 0x2a44f): HAL_TIMEOUT
    <42f>   DW_AT_const_value : 3
 <2><430>: Abbrev Number: 0
 <1><431>: Abbrev Number: 3 (DW_TAG_typedef)
    <432>   DW_AT_name        : (indirect string, offset: 0x1bec): HAL_StatusTypeDef
    <436>   DW_AT_decl_file   : 9
    <437>   DW_AT_decl_line   : 44
    <438>   DW_AT_decl_column : 3
    <439>   DW_AT_type        : <0x40a>
 <1><43d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <43e>   DW_AT_encoding    : 7	(unsigned)
    <43f>   DW_AT_byte_size   : 1
    <440>   DW_AT_type        : <0x8a>
    <444>   DW_AT_decl_file   : 9
    <445>   DW_AT_decl_line   : 50
    <446>   DW_AT_decl_column : 1
    <447>   DW_AT_sibling     : <0x458>
 <2><44b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <44c>   DW_AT_name        : (indirect string, offset: 0x6a561): HAL_UNLOCKED
    <450>   DW_AT_const_value : 0
 <2><451>: Abbrev Number: 17 (DW_TAG_enumerator)
    <452>   DW_AT_name        : (indirect string, offset: 0x8ed18): HAL_LOCKED
    <456>   DW_AT_const_value : 1
 <2><457>: Abbrev Number: 0
 <1><458>: Abbrev Number: 3 (DW_TAG_typedef)
    <459>   DW_AT_name        : (indirect string, offset: 0x5485c): HAL_LockTypeDef
    <45d>   DW_AT_decl_file   : 9
    <45e>   DW_AT_decl_line   : 53
    <45f>   DW_AT_decl_column : 3
    <460>   DW_AT_type        : <0x43d>
 <1><464>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <465>   DW_AT_prototyped  : 1
 <1><465>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <466>   DW_AT_byte_size   : 4
    <467>   DW_AT_type        : <0x464>
 <1><46b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <46c>   DW_AT_byte_size   : 28
    <46d>   DW_AT_decl_file   : 10
    <46e>   DW_AT_decl_line   : 47
    <46f>   DW_AT_decl_column : 9
    <470>   DW_AT_sibling     : <0x4d0>
 <2><474>: Abbrev Number: 20 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x9185f): Direction
    <479>   DW_AT_decl_file   : 10
    <47a>   DW_AT_decl_line   : 49
    <47b>   DW_AT_decl_column : 12
    <47c>   DW_AT_type        : <0x106>
    <480>   DW_AT_data_member_location: 0
 <2><481>: Abbrev Number: 20 (DW_TAG_member)
    <482>   DW_AT_name        : (indirect string, offset: 0x9b65): PeriphInc
    <486>   DW_AT_decl_file   : 10
    <487>   DW_AT_decl_line   : 53
    <488>   DW_AT_decl_column : 12
    <489>   DW_AT_type        : <0x106>
    <48d>   DW_AT_data_member_location: 4
 <2><48e>: Abbrev Number: 20 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0x16332): MemInc
    <493>   DW_AT_decl_file   : 10
    <494>   DW_AT_decl_line   : 56
    <495>   DW_AT_decl_column : 12
    <496>   DW_AT_type        : <0x106>
    <49a>   DW_AT_data_member_location: 8
 <2><49b>: Abbrev Number: 20 (DW_TAG_member)
    <49c>   DW_AT_name        : (indirect string, offset: 0x47751): PeriphDataAlignment
    <4a0>   DW_AT_decl_file   : 10
    <4a1>   DW_AT_decl_line   : 59
    <4a2>   DW_AT_decl_column : 12
    <4a3>   DW_AT_type        : <0x106>
    <4a7>   DW_AT_data_member_location: 12
 <2><4a8>: Abbrev Number: 20 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x81ae4): MemDataAlignment
    <4ad>   DW_AT_decl_file   : 10
    <4ae>   DW_AT_decl_line   : 62
    <4af>   DW_AT_decl_column : 12
    <4b0>   DW_AT_type        : <0x106>
    <4b4>   DW_AT_data_member_location: 16
 <2><4b5>: Abbrev Number: 20 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x9245c): Mode
    <4ba>   DW_AT_decl_file   : 10
    <4bb>   DW_AT_decl_line   : 65
    <4bc>   DW_AT_decl_column : 12
    <4bd>   DW_AT_type        : <0x106>
    <4c1>   DW_AT_data_member_location: 20
 <2><4c2>: Abbrev Number: 20 (DW_TAG_member)
    <4c3>   DW_AT_name        : (indirect string, offset: 0x90bbc): Priority
    <4c7>   DW_AT_decl_file   : 10
    <4c8>   DW_AT_decl_line   : 70
    <4c9>   DW_AT_decl_column : 12
    <4ca>   DW_AT_type        : <0x106>
    <4ce>   DW_AT_data_member_location: 24
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 3 (DW_TAG_typedef)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x2665a): DMA_InitTypeDef
    <4d5>   DW_AT_decl_file   : 10
    <4d6>   DW_AT_decl_line   : 72
    <4d7>   DW_AT_decl_column : 3
    <4d8>   DW_AT_type        : <0x46b>
 <1><4dc>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <4dd>   DW_AT_encoding    : 7	(unsigned)
    <4de>   DW_AT_byte_size   : 1
    <4df>   DW_AT_type        : <0x8a>
    <4e3>   DW_AT_decl_file   : 10
    <4e4>   DW_AT_decl_line   : 78
    <4e5>   DW_AT_decl_column : 1
    <4e6>   DW_AT_sibling     : <0x503>
 <2><4ea>: Abbrev Number: 17 (DW_TAG_enumerator)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x6b5ee): HAL_DMA_STATE_RESET
    <4ef>   DW_AT_const_value : 0
 <2><4f0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <4f1>   DW_AT_name        : (indirect string, offset: 0x2740a): HAL_DMA_STATE_READY
    <4f5>   DW_AT_const_value : 1
 <2><4f6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x63e00): HAL_DMA_STATE_BUSY
    <4fb>   DW_AT_const_value : 2
 <2><4fc>: Abbrev Number: 17 (DW_TAG_enumerator)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x8c7dd): HAL_DMA_STATE_TIMEOUT
    <501>   DW_AT_const_value : 3
 <2><502>: Abbrev Number: 0
 <1><503>: Abbrev Number: 3 (DW_TAG_typedef)
    <504>   DW_AT_name        : (indirect string, offset: 0x4f311): HAL_DMA_StateTypeDef
    <508>   DW_AT_decl_file   : 10
    <509>   DW_AT_decl_line   : 83
    <50a>   DW_AT_decl_column : 2
    <50b>   DW_AT_type        : <0x4dc>
 <1><50f>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <510>   DW_AT_type        : <0x503>
 <1><514>: Abbrev Number: 21 (DW_TAG_structure_type)
    <515>   DW_AT_name        : (indirect string, offset: 0x7a9a6): __DMA_HandleTypeDef
    <519>   DW_AT_byte_size   : 68
    <51a>   DW_AT_decl_file   : 10
    <51b>   DW_AT_decl_line   : 110
    <51c>   DW_AT_decl_column : 16
    <51d>   DW_AT_sibling     : <0x5be>
 <2><521>: Abbrev Number: 20 (DW_TAG_member)
    <522>   DW_AT_name        : (indirect string, offset: 0x3821f): Instance
    <526>   DW_AT_decl_file   : 10
    <527>   DW_AT_decl_line   : 112
    <528>   DW_AT_decl_column : 31
    <529>   DW_AT_type        : <0x5be>
    <52d>   DW_AT_data_member_location: 0
 <2><52e>: Abbrev Number: 20 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0x40f3c): Init
    <533>   DW_AT_decl_file   : 10
    <534>   DW_AT_decl_line   : 114
    <535>   DW_AT_decl_column : 30
    <536>   DW_AT_type        : <0x4d0>
    <53a>   DW_AT_data_member_location: 4
 <2><53b>: Abbrev Number: 20 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0x66bb6): Lock
    <540>   DW_AT_decl_file   : 10
    <541>   DW_AT_decl_line   : 116
    <542>   DW_AT_decl_column : 30
    <543>   DW_AT_type        : <0x458>
    <547>   DW_AT_data_member_location: 32
 <2><548>: Abbrev Number: 20 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0x8fd5d): State
    <54d>   DW_AT_decl_file   : 10
    <54e>   DW_AT_decl_line   : 118
    <54f>   DW_AT_decl_column : 30
    <550>   DW_AT_type        : <0x50f>
    <554>   DW_AT_data_member_location: 33
 <2><555>: Abbrev Number: 20 (DW_TAG_member)
    <556>   DW_AT_name        : (indirect string, offset: 0x883ef): Parent
    <55a>   DW_AT_decl_file   : 10
    <55b>   DW_AT_decl_line   : 120
    <55c>   DW_AT_decl_column : 31
    <55d>   DW_AT_type        : <0x117>
    <561>   DW_AT_data_member_location: 36
 <2><562>: Abbrev Number: 20 (DW_TAG_member)
    <563>   DW_AT_name        : (indirect string, offset: 0x8e323): XferCpltCallback
    <567>   DW_AT_decl_file   : 10
    <568>   DW_AT_decl_line   : 122
    <569>   DW_AT_decl_column : 33
    <56a>   DW_AT_type        : <0x5d5>
    <56e>   DW_AT_data_member_location: 40
 <2><56f>: Abbrev Number: 20 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x70135): XferHalfCpltCallback
    <574>   DW_AT_decl_file   : 10
    <575>   DW_AT_decl_line   : 124
    <576>   DW_AT_decl_column : 33
    <577>   DW_AT_type        : <0x5d5>
    <57b>   DW_AT_data_member_location: 44
 <2><57c>: Abbrev Number: 20 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0x145b1): XferErrorCallback
    <581>   DW_AT_decl_file   : 10
    <582>   DW_AT_decl_line   : 126
    <583>   DW_AT_decl_column : 33
    <584>   DW_AT_type        : <0x5d5>
    <588>   DW_AT_data_member_location: 48
 <2><589>: Abbrev Number: 20 (DW_TAG_member)
    <58a>   DW_AT_name        : (indirect string, offset: 0x85c0a): XferAbortCallback
    <58e>   DW_AT_decl_file   : 10
    <58f>   DW_AT_decl_line   : 128
    <590>   DW_AT_decl_column : 33
    <591>   DW_AT_type        : <0x5d5>
    <595>   DW_AT_data_member_location: 52
 <2><596>: Abbrev Number: 20 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0x8baf9): ErrorCode
    <59b>   DW_AT_decl_file   : 10
    <59c>   DW_AT_decl_line   : 130
    <59d>   DW_AT_decl_column : 30
    <59e>   DW_AT_type        : <0x112>
    <5a2>   DW_AT_data_member_location: 56
 <2><5a3>: Abbrev Number: 20 (DW_TAG_member)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x3daa8): DmaBaseAddress
    <5a8>   DW_AT_decl_file   : 10
    <5a9>   DW_AT_decl_line   : 132
    <5aa>   DW_AT_decl_column : 31
    <5ab>   DW_AT_type        : <0x5db>
    <5af>   DW_AT_data_member_location: 60
 <2><5b0>: Abbrev Number: 20 (DW_TAG_member)
    <5b1>   DW_AT_name        : (indirect string, offset: 0x1d712): ChannelIndex
    <5b5>   DW_AT_decl_file   : 10
    <5b6>   DW_AT_decl_line   : 134
    <5b7>   DW_AT_decl_column : 30
    <5b8>   DW_AT_type        : <0x106>
    <5bc>   DW_AT_data_member_location: 64
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5bf>   DW_AT_byte_size   : 4
    <5c0>   DW_AT_type        : <0x2bc>
 <1><5c4>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5c5>   DW_AT_prototyped  : 1
    <5c5>   DW_AT_sibling     : <0x5cf>
 <2><5c9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5ca>   DW_AT_type        : <0x5cf>
 <2><5ce>: Abbrev Number: 0
 <1><5cf>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5d0>   DW_AT_byte_size   : 4
    <5d1>   DW_AT_type        : <0x514>
 <1><5d5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5d6>   DW_AT_byte_size   : 4
    <5d7>   DW_AT_type        : <0x5c4>
 <1><5db>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5dc>   DW_AT_byte_size   : 4
    <5dd>   DW_AT_type        : <0x2f0>
 <1><5e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x7a9a8): DMA_HandleTypeDef
    <5e6>   DW_AT_decl_file   : 10
    <5e7>   DW_AT_decl_line   : 136
    <5e8>   DW_AT_decl_column : 3
    <5e9>   DW_AT_type        : <0x514>
 <1><5ed>: Abbrev Number: 19 (DW_TAG_structure_type)
    <5ee>   DW_AT_byte_size   : 32
    <5ef>   DW_AT_decl_file   : 11
    <5f0>   DW_AT_decl_line   : 47
    <5f1>   DW_AT_decl_column : 9
    <5f2>   DW_AT_sibling     : <0x65f>
 <2><5f6>: Abbrev Number: 20 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x871d2): ClockSpeed
    <5fb>   DW_AT_decl_file   : 11
    <5fc>   DW_AT_decl_line   : 49
    <5fd>   DW_AT_decl_column : 12
    <5fe>   DW_AT_type        : <0x106>
    <602>   DW_AT_data_member_location: 0
 <2><603>: Abbrev Number: 20 (DW_TAG_member)
    <604>   DW_AT_name        : (indirect string, offset: 0x57281): DutyCycle
    <608>   DW_AT_decl_file   : 11
    <609>   DW_AT_decl_line   : 52
    <60a>   DW_AT_decl_column : 12
    <60b>   DW_AT_type        : <0x106>
    <60f>   DW_AT_data_member_location: 4
 <2><610>: Abbrev Number: 20 (DW_TAG_member)
    <611>   DW_AT_name        : (indirect string, offset: 0x339e7): OwnAddress1
    <615>   DW_AT_decl_file   : 11
    <616>   DW_AT_decl_line   : 55
    <617>   DW_AT_decl_column : 12
    <618>   DW_AT_type        : <0x106>
    <61c>   DW_AT_data_member_location: 8
 <2><61d>: Abbrev Number: 20 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x3d9e6): AddressingMode
    <622>   DW_AT_decl_file   : 11
    <623>   DW_AT_decl_line   : 58
    <624>   DW_AT_decl_column : 12
    <625>   DW_AT_type        : <0x106>
    <629>   DW_AT_data_member_location: 12
 <2><62a>: Abbrev Number: 20 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x67970): DualAddressMode
    <62f>   DW_AT_decl_file   : 11
    <630>   DW_AT_decl_line   : 61
    <631>   DW_AT_decl_column : 12
    <632>   DW_AT_type        : <0x106>
    <636>   DW_AT_data_member_location: 16
 <2><637>: Abbrev Number: 20 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0x339f3): OwnAddress2
    <63c>   DW_AT_decl_file   : 11
    <63d>   DW_AT_decl_line   : 64
    <63e>   DW_AT_decl_column : 12
    <63f>   DW_AT_type        : <0x106>
    <643>   DW_AT_data_member_location: 20
 <2><644>: Abbrev Number: 20 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x171ec): GeneralCallMode
    <649>   DW_AT_decl_file   : 11
    <64a>   DW_AT_decl_line   : 67
    <64b>   DW_AT_decl_column : 12
    <64c>   DW_AT_type        : <0x106>
    <650>   DW_AT_data_member_location: 24
 <2><651>: Abbrev Number: 20 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x2c40c): NoStretchMode
    <656>   DW_AT_decl_file   : 11
    <657>   DW_AT_decl_line   : 70
    <658>   DW_AT_decl_column : 12
    <659>   DW_AT_type        : <0x106>
    <65d>   DW_AT_data_member_location: 28
 <2><65e>: Abbrev Number: 0
 <1><65f>: Abbrev Number: 3 (DW_TAG_typedef)
    <660>   DW_AT_name        : (indirect string, offset: 0x2da24): I2C_InitTypeDef
    <664>   DW_AT_decl_file   : 11
    <665>   DW_AT_decl_line   : 73
    <666>   DW_AT_decl_column : 3
    <667>   DW_AT_type        : <0x5ed>
 <1><66b>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <66c>   DW_AT_encoding    : 7	(unsigned)
    <66d>   DW_AT_byte_size   : 1
    <66e>   DW_AT_type        : <0x8a>
    <672>   DW_AT_decl_file   : 11
    <673>   DW_AT_decl_line   : 107
    <674>   DW_AT_decl_column : 1
    <675>   DW_AT_sibling     : <0x6bc>
 <2><679>: Abbrev Number: 17 (DW_TAG_enumerator)
    <67a>   DW_AT_name        : (indirect string, offset: 0x7b3a): HAL_I2C_STATE_RESET
    <67e>   DW_AT_const_value : 0
 <2><67f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <680>   DW_AT_name        : (indirect string, offset: 0x2e68e): HAL_I2C_STATE_READY
    <684>   DW_AT_const_value : 32
 <2><685>: Abbrev Number: 17 (DW_TAG_enumerator)
    <686>   DW_AT_name        : (indirect string, offset: 0x29bb9): HAL_I2C_STATE_BUSY
    <68a>   DW_AT_const_value : 36
 <2><68b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <68c>   DW_AT_name        : (indirect string, offset: 0x67adb): HAL_I2C_STATE_BUSY_TX
    <690>   DW_AT_const_value : 33
 <2><691>: Abbrev Number: 17 (DW_TAG_enumerator)
    <692>   DW_AT_name        : (indirect string, offset: 0x31fed): HAL_I2C_STATE_BUSY_RX
    <696>   DW_AT_const_value : 34
 <2><697>: Abbrev Number: 17 (DW_TAG_enumerator)
    <698>   DW_AT_name        : (indirect string, offset: 0x38f91): HAL_I2C_STATE_LISTEN
    <69c>   DW_AT_const_value : 40
 <2><69d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <69e>   DW_AT_name        : (indirect string, offset: 0x22839): HAL_I2C_STATE_BUSY_TX_LISTEN
    <6a2>   DW_AT_const_value : 41
 <2><6a3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x636e2): HAL_I2C_STATE_BUSY_RX_LISTEN
    <6a8>   DW_AT_const_value : 42
 <2><6a9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x36a0a): HAL_I2C_STATE_ABORT
    <6ae>   DW_AT_const_value : 96
 <2><6af>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x78604): HAL_I2C_STATE_TIMEOUT
    <6b4>   DW_AT_const_value : 160
 <2><6b5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x823bc): HAL_I2C_STATE_ERROR
    <6ba>   DW_AT_const_value : 224
 <2><6bb>: Abbrev Number: 0
 <1><6bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x17d6e): HAL_I2C_StateTypeDef
    <6c1>   DW_AT_decl_file   : 11
    <6c2>   DW_AT_decl_line   : 122
    <6c3>   DW_AT_decl_column : 3
    <6c4>   DW_AT_type        : <0x66b>
 <1><6c8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <6c9>   DW_AT_type        : <0x6bc>
 <1><6cd>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <6ce>   DW_AT_encoding    : 7	(unsigned)
    <6cf>   DW_AT_byte_size   : 1
    <6d0>   DW_AT_type        : <0x8a>
    <6d4>   DW_AT_decl_file   : 11
    <6d5>   DW_AT_decl_line   : 147
    <6d6>   DW_AT_decl_column : 1
    <6d7>   DW_AT_sibling     : <0x6f4>
 <2><6db>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6dc>   DW_AT_name        : (indirect string, offset: 0x259a9): HAL_I2C_MODE_NONE
    <6e0>   DW_AT_const_value : 0
 <2><6e1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6e2>   DW_AT_name        : (indirect string, offset: 0x2aaa): HAL_I2C_MODE_MASTER
    <6e6>   DW_AT_const_value : 16
 <2><6e7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6e8>   DW_AT_name        : (indirect string, offset: 0x83403): HAL_I2C_MODE_SLAVE
    <6ec>   DW_AT_const_value : 32
 <2><6ed>: Abbrev Number: 17 (DW_TAG_enumerator)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x2d677): HAL_I2C_MODE_MEM
    <6f2>   DW_AT_const_value : 64
 <2><6f3>: Abbrev Number: 0
 <1><6f4>: Abbrev Number: 3 (DW_TAG_typedef)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x45c91): HAL_I2C_ModeTypeDef
    <6f9>   DW_AT_decl_file   : 11
    <6fa>   DW_AT_decl_line   : 153
    <6fb>   DW_AT_decl_column : 3
    <6fc>   DW_AT_type        : <0x6cd>
 <1><700>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <701>   DW_AT_type        : <0x6f4>
 <1><705>: Abbrev Number: 19 (DW_TAG_structure_type)
    <706>   DW_AT_byte_size   : 84
    <707>   DW_AT_decl_file   : 11
    <708>   DW_AT_decl_line   : 187
    <709>   DW_AT_decl_column : 9
    <70a>   DW_AT_sibling     : <0x7ec>
 <2><70e>: Abbrev Number: 20 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x3821f): Instance
    <713>   DW_AT_decl_file   : 11
    <714>   DW_AT_decl_line   : 190
    <715>   DW_AT_decl_column : 31
    <716>   DW_AT_type        : <0x7ec>
    <71a>   DW_AT_data_member_location: 0
 <2><71b>: Abbrev Number: 20 (DW_TAG_member)
    <71c>   DW_AT_name        : (indirect string, offset: 0x40f3c): Init
    <720>   DW_AT_decl_file   : 11
    <721>   DW_AT_decl_line   : 192
    <722>   DW_AT_decl_column : 30
    <723>   DW_AT_type        : <0x65f>
    <727>   DW_AT_data_member_location: 4
 <2><728>: Abbrev Number: 20 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0xdc6c): pBuffPtr
    <72d>   DW_AT_decl_file   : 11
    <72e>   DW_AT_decl_line   : 194
    <72f>   DW_AT_decl_column : 31
    <730>   DW_AT_type        : <0x13d>
    <734>   DW_AT_data_member_location: 36
 <2><735>: Abbrev Number: 20 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0x447c7): XferSize
    <73a>   DW_AT_decl_file   : 11
    <73b>   DW_AT_decl_line   : 196
    <73c>   DW_AT_decl_column : 30
    <73d>   DW_AT_type        : <0xf5>
    <741>   DW_AT_data_member_location: 40
 <2><742>: Abbrev Number: 20 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0x5644a): XferCount
    <747>   DW_AT_decl_file   : 11
    <748>   DW_AT_decl_line   : 198
    <749>   DW_AT_decl_column : 30
    <74a>   DW_AT_type        : <0x101>
    <74e>   DW_AT_data_member_location: 42
 <2><74f>: Abbrev Number: 20 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x911eb): XferOptions
    <754>   DW_AT_decl_file   : 11
    <755>   DW_AT_decl_line   : 200
    <756>   DW_AT_decl_column : 30
    <757>   DW_AT_type        : <0x112>
    <75b>   DW_AT_data_member_location: 44
 <2><75c>: Abbrev Number: 20 (DW_TAG_member)
    <75d>   DW_AT_name        : (indirect string, offset: 0x40319): PreviousState
    <761>   DW_AT_decl_file   : 11
    <762>   DW_AT_decl_line   : 202
    <763>   DW_AT_decl_column : 30
    <764>   DW_AT_type        : <0x112>
    <768>   DW_AT_data_member_location: 48
 <2><769>: Abbrev Number: 20 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0x8b34a): hdmatx
    <76e>   DW_AT_decl_file   : 11
    <76f>   DW_AT_decl_line   : 205
    <770>   DW_AT_decl_column : 31
    <771>   DW_AT_type        : <0x7f2>
    <775>   DW_AT_data_member_location: 52
 <2><776>: Abbrev Number: 20 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x8aa50): hdmarx
    <77b>   DW_AT_decl_file   : 11
    <77c>   DW_AT_decl_line   : 207
    <77d>   DW_AT_decl_column : 31
    <77e>   DW_AT_type        : <0x7f2>
    <782>   DW_AT_data_member_location: 56
 <2><783>: Abbrev Number: 20 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x66bb6): Lock
    <788>   DW_AT_decl_file   : 11
    <789>   DW_AT_decl_line   : 209
    <78a>   DW_AT_decl_column : 30
    <78b>   DW_AT_type        : <0x458>
    <78f>   DW_AT_data_member_location: 60
 <2><790>: Abbrev Number: 20 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x8fd5d): State
    <795>   DW_AT_decl_file   : 11
    <796>   DW_AT_decl_line   : 211
    <797>   DW_AT_decl_column : 30
    <798>   DW_AT_type        : <0x6c8>
    <79c>   DW_AT_data_member_location: 61
 <2><79d>: Abbrev Number: 20 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0x9245c): Mode
    <7a2>   DW_AT_decl_file   : 11
    <7a3>   DW_AT_decl_line   : 213
    <7a4>   DW_AT_decl_column : 30
    <7a5>   DW_AT_type        : <0x700>
    <7a9>   DW_AT_data_member_location: 62
 <2><7aa>: Abbrev Number: 20 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x8baf9): ErrorCode
    <7af>   DW_AT_decl_file   : 11
    <7b0>   DW_AT_decl_line   : 215
    <7b1>   DW_AT_decl_column : 30
    <7b2>   DW_AT_type        : <0x112>
    <7b6>   DW_AT_data_member_location: 64
 <2><7b7>: Abbrev Number: 20 (DW_TAG_member)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x5d4e5): Devaddress
    <7bc>   DW_AT_decl_file   : 11
    <7bd>   DW_AT_decl_line   : 217
    <7be>   DW_AT_decl_column : 30
    <7bf>   DW_AT_type        : <0x112>
    <7c3>   DW_AT_data_member_location: 68
 <2><7c4>: Abbrev Number: 20 (DW_TAG_member)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x57d39): Memaddress
    <7c9>   DW_AT_decl_file   : 11
    <7ca>   DW_AT_decl_line   : 219
    <7cb>   DW_AT_decl_column : 30
    <7cc>   DW_AT_type        : <0x112>
    <7d0>   DW_AT_data_member_location: 72
 <2><7d1>: Abbrev Number: 20 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x44148): MemaddSize
    <7d6>   DW_AT_decl_file   : 11
    <7d7>   DW_AT_decl_line   : 221
    <7d8>   DW_AT_decl_column : 30
    <7d9>   DW_AT_type        : <0x112>
    <7dd>   DW_AT_data_member_location: 76
 <2><7de>: Abbrev Number: 20 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0x44906): EventCount
    <7e3>   DW_AT_decl_file   : 11
    <7e4>   DW_AT_decl_line   : 223
    <7e5>   DW_AT_decl_column : 30
    <7e6>   DW_AT_type        : <0x112>
    <7ea>   DW_AT_data_member_location: 80
 <2><7eb>: Abbrev Number: 0
 <1><7ec>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7ed>   DW_AT_byte_size   : 4
    <7ee>   DW_AT_type        : <0x385>
 <1><7f2>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7f3>   DW_AT_byte_size   : 4
    <7f4>   DW_AT_type        : <0x5e1>
 <1><7f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <7f9>   DW_AT_name        : (indirect string, offset: 0x7253b): I2C_HandleTypeDef
    <7fd>   DW_AT_decl_file   : 11
    <7fe>   DW_AT_decl_line   : 243
    <7ff>   DW_AT_decl_column : 3
    <800>   DW_AT_type        : <0x705>
 <1><804>: Abbrev Number: 19 (DW_TAG_structure_type)
    <805>   DW_AT_byte_size   : 28
    <806>   DW_AT_decl_file   : 12
    <807>   DW_AT_decl_line   : 46
    <808>   DW_AT_decl_column : 9
    <809>   DW_AT_sibling     : <0x869>
 <2><80d>: Abbrev Number: 20 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0x833e0): BaudRate
    <812>   DW_AT_decl_file   : 12
    <813>   DW_AT_decl_line   : 48
    <814>   DW_AT_decl_column : 12
    <815>   DW_AT_type        : <0x106>
    <819>   DW_AT_data_member_location: 0
 <2><81a>: Abbrev Number: 20 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0x426d): WordLength
    <81f>   DW_AT_decl_file   : 12
    <820>   DW_AT_decl_line   : 53
    <821>   DW_AT_decl_column : 12
    <822>   DW_AT_type        : <0x106>
    <826>   DW_AT_data_member_location: 4
 <2><827>: Abbrev Number: 20 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x83664): StopBits
    <82c>   DW_AT_decl_file   : 12
    <82d>   DW_AT_decl_line   : 56
    <82e>   DW_AT_decl_column : 12
    <82f>   DW_AT_type        : <0x106>
    <833>   DW_AT_data_member_location: 8
 <2><834>: Abbrev Number: 20 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x33938): Parity
    <839>   DW_AT_decl_file   : 12
    <83a>   DW_AT_decl_line   : 59
    <83b>   DW_AT_decl_column : 12
    <83c>   DW_AT_type        : <0x106>
    <840>   DW_AT_data_member_location: 12
 <2><841>: Abbrev Number: 20 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x9245c): Mode
    <846>   DW_AT_decl_file   : 12
    <847>   DW_AT_decl_line   : 66
    <848>   DW_AT_decl_column : 12
    <849>   DW_AT_type        : <0x106>
    <84d>   DW_AT_data_member_location: 16
 <2><84e>: Abbrev Number: 20 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x10d89): HwFlowCtl
    <853>   DW_AT_decl_file   : 12
    <854>   DW_AT_decl_line   : 69
    <855>   DW_AT_decl_column : 12
    <856>   DW_AT_type        : <0x106>
    <85a>   DW_AT_data_member_location: 20
 <2><85b>: Abbrev Number: 20 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x78e69): OverSampling
    <860>   DW_AT_decl_file   : 12
    <861>   DW_AT_decl_line   : 72
    <862>   DW_AT_decl_column : 12
    <863>   DW_AT_type        : <0x106>
    <867>   DW_AT_data_member_location: 24
 <2><868>: Abbrev Number: 0
 <1><869>: Abbrev Number: 3 (DW_TAG_typedef)
    <86a>   DW_AT_name        : (indirect string, offset: 0x285fc): UART_InitTypeDef
    <86e>   DW_AT_decl_file   : 12
    <86f>   DW_AT_decl_line   : 75
    <870>   DW_AT_decl_column : 3
    <871>   DW_AT_type        : <0x804>
 <1><875>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <876>   DW_AT_encoding    : 7	(unsigned)
    <877>   DW_AT_byte_size   : 1
    <878>   DW_AT_type        : <0x8a>
    <87c>   DW_AT_decl_file   : 12
    <87d>   DW_AT_decl_line   : 117
    <87e>   DW_AT_decl_column : 1
    <87f>   DW_AT_sibling     : <0x8b4>
 <2><883>: Abbrev Number: 17 (DW_TAG_enumerator)
    <884>   DW_AT_name        : (indirect string, offset: 0x3d5a3): HAL_UART_STATE_RESET
    <888>   DW_AT_const_value : 0
 <2><889>: Abbrev Number: 17 (DW_TAG_enumerator)
    <88a>   DW_AT_name        : (indirect string, offset: 0x108fa): HAL_UART_STATE_READY
    <88e>   DW_AT_const_value : 32
 <2><88f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <890>   DW_AT_name        : (indirect string, offset: 0x7f418): HAL_UART_STATE_BUSY
    <894>   DW_AT_const_value : 36
 <2><895>: Abbrev Number: 17 (DW_TAG_enumerator)
    <896>   DW_AT_name        : (indirect string, offset: 0x1cfc): HAL_UART_STATE_BUSY_TX
    <89a>   DW_AT_const_value : 33
 <2><89b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <89c>   DW_AT_name        : (indirect string, offset: 0x1172): HAL_UART_STATE_BUSY_RX
    <8a0>   DW_AT_const_value : 34
 <2><8a1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x201ec): HAL_UART_STATE_BUSY_TX_RX
    <8a6>   DW_AT_const_value : 35
 <2><8a7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <8a8>   DW_AT_name        : (indirect string, offset: 0x45e5b): HAL_UART_STATE_TIMEOUT
    <8ac>   DW_AT_const_value : 160
 <2><8ad>: Abbrev Number: 17 (DW_TAG_enumerator)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x64a10): HAL_UART_STATE_ERROR
    <8b2>   DW_AT_const_value : 224
 <2><8b3>: Abbrev Number: 0
 <1><8b4>: Abbrev Number: 3 (DW_TAG_typedef)
    <8b5>   DW_AT_name        : (indirect string, offset: 0x2bfe5): HAL_UART_StateTypeDef
    <8b9>   DW_AT_decl_file   : 12
    <8ba>   DW_AT_decl_line   : 135
    <8bb>   DW_AT_decl_column : 3
    <8bc>   DW_AT_type        : <0x875>
 <1><8c0>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8c1>   DW_AT_type        : <0x8b4>
 <1><8c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x3b125): HAL_UART_RxTypeTypeDef
    <8ca>   DW_AT_decl_file   : 12
    <8cb>   DW_AT_decl_line   : 144
    <8cc>   DW_AT_decl_column : 18
    <8cd>   DW_AT_type        : <0x106>
 <1><8d1>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8d2>   DW_AT_type        : <0x8c5>
 <1><8d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x11c9f): HAL_UART_RxEventTypeTypeDef
    <8db>   DW_AT_decl_file   : 12
    <8dc>   DW_AT_decl_line   : 155
    <8dd>   DW_AT_decl_column : 18
    <8de>   DW_AT_type        : <0x106>
 <1><8e2>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8e3>   DW_AT_type        : <0x8d6>
 <1><8e7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x53009): __UART_HandleTypeDef
    <8ec>   DW_AT_byte_size   : 72
    <8ed>   DW_AT_decl_file   : 12
    <8ee>   DW_AT_decl_line   : 160
    <8ef>   DW_AT_decl_column : 16
    <8f0>   DW_AT_sibling     : <0x9c5>
 <2><8f4>: Abbrev Number: 20 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x3821f): Instance
    <8f9>   DW_AT_decl_file   : 12
    <8fa>   DW_AT_decl_line   : 162
    <8fb>   DW_AT_decl_column : 34
    <8fc>   DW_AT_type        : <0x9c5>
    <900>   DW_AT_data_member_location: 0
 <2><901>: Abbrev Number: 20 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0x40f3c): Init
    <906>   DW_AT_decl_file   : 12
    <907>   DW_AT_decl_line   : 164
    <908>   DW_AT_decl_column : 33
    <909>   DW_AT_type        : <0x869>
    <90d>   DW_AT_data_member_location: 4
 <2><90e>: Abbrev Number: 20 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x44ff2): pTxBuffPtr
    <913>   DW_AT_decl_file   : 12
    <914>   DW_AT_decl_line   : 166
    <915>   DW_AT_decl_column : 34
    <916>   DW_AT_type        : <0x9cb>
    <91a>   DW_AT_data_member_location: 32
 <2><91b>: Abbrev Number: 20 (DW_TAG_member)
    <91c>   DW_AT_name        : (indirect string, offset: 0x3d01e): TxXferSize
    <920>   DW_AT_decl_file   : 12
    <921>   DW_AT_decl_line   : 168
    <922>   DW_AT_decl_column : 33
    <923>   DW_AT_type        : <0xf5>
    <927>   DW_AT_data_member_location: 36
 <2><928>: Abbrev Number: 20 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x45cfd): TxXferCount
    <92d>   DW_AT_decl_file   : 12
    <92e>   DW_AT_decl_line   : 170
    <92f>   DW_AT_decl_column : 33
    <930>   DW_AT_type        : <0x101>
    <934>   DW_AT_data_member_location: 38
 <2><935>: Abbrev Number: 20 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0x851db): pRxBuffPtr
    <93a>   DW_AT_decl_file   : 12
    <93b>   DW_AT_decl_line   : 172
    <93c>   DW_AT_decl_column : 34
    <93d>   DW_AT_type        : <0x13d>
    <941>   DW_AT_data_member_location: 40
 <2><942>: Abbrev Number: 20 (DW_TAG_member)
    <943>   DW_AT_name        : (indirect string, offset: 0x447c5): RxXferSize
    <947>   DW_AT_decl_file   : 12
    <948>   DW_AT_decl_line   : 174
    <949>   DW_AT_decl_column : 33
    <94a>   DW_AT_type        : <0xf5>
    <94e>   DW_AT_data_member_location: 44
 <2><94f>: Abbrev Number: 20 (DW_TAG_member)
    <950>   DW_AT_name        : (indirect string, offset: 0x56448): RxXferCount
    <954>   DW_AT_decl_file   : 12
    <955>   DW_AT_decl_line   : 176
    <956>   DW_AT_decl_column : 33
    <957>   DW_AT_type        : <0x101>
    <95b>   DW_AT_data_member_location: 46
 <2><95c>: Abbrev Number: 20 (DW_TAG_member)
    <95d>   DW_AT_name        : (indirect string, offset: 0x78697): ReceptionType
    <961>   DW_AT_decl_file   : 12
    <962>   DW_AT_decl_line   : 178
    <963>   DW_AT_decl_column : 31
    <964>   DW_AT_type        : <0x8d1>
    <968>   DW_AT_data_member_location: 48
 <2><969>: Abbrev Number: 20 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0x93317): RxEventType
    <96e>   DW_AT_decl_file   : 12
    <96f>   DW_AT_decl_line   : 180
    <970>   DW_AT_decl_column : 36
    <971>   DW_AT_type        : <0x8e2>
    <975>   DW_AT_data_member_location: 52
 <2><976>: Abbrev Number: 20 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0x8b34a): hdmatx
    <97b>   DW_AT_decl_file   : 12
    <97c>   DW_AT_decl_line   : 182
    <97d>   DW_AT_decl_column : 34
    <97e>   DW_AT_type        : <0x7f2>
    <982>   DW_AT_data_member_location: 56
 <2><983>: Abbrev Number: 20 (DW_TAG_member)
    <984>   DW_AT_name        : (indirect string, offset: 0x8aa50): hdmarx
    <988>   DW_AT_decl_file   : 12
    <989>   DW_AT_decl_line   : 184
    <98a>   DW_AT_decl_column : 34
    <98b>   DW_AT_type        : <0x7f2>
    <98f>   DW_AT_data_member_location: 60
 <2><990>: Abbrev Number: 20 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x66bb6): Lock
    <995>   DW_AT_decl_file   : 12
    <996>   DW_AT_decl_line   : 186
    <997>   DW_AT_decl_column : 33
    <998>   DW_AT_type        : <0x458>
    <99c>   DW_AT_data_member_location: 64
 <2><99d>: Abbrev Number: 20 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x3a9a4): gState
    <9a2>   DW_AT_decl_file   : 12
    <9a3>   DW_AT_decl_line   : 188
    <9a4>   DW_AT_decl_column : 33
    <9a5>   DW_AT_type        : <0x8c0>
    <9a9>   DW_AT_data_member_location: 65
 <2><9aa>: Abbrev Number: 20 (DW_TAG_member)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x814bc): RxState
    <9af>   DW_AT_decl_file   : 12
    <9b0>   DW_AT_decl_line   : 192
    <9b1>   DW_AT_decl_column : 33
    <9b2>   DW_AT_type        : <0x8c0>
    <9b6>   DW_AT_data_member_location: 66
 <2><9b7>: Abbrev Number: 20 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0x8baf9): ErrorCode
    <9bc>   DW_AT_decl_file   : 12
    <9bd>   DW_AT_decl_line   : 195
    <9be>   DW_AT_decl_column : 33
    <9bf>   DW_AT_type        : <0x112>
    <9c3>   DW_AT_data_member_location: 68
 <2><9c4>: Abbrev Number: 0
 <1><9c5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <9c6>   DW_AT_byte_size   : 4
    <9c7>   DW_AT_type        : <0x3fd>
 <1><9cb>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <9cc>   DW_AT_byte_size   : 4
    <9cd>   DW_AT_type        : <0xe4>
 <1><9d1>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x5300b): UART_HandleTypeDef
    <9d6>   DW_AT_decl_file   : 12
    <9d7>   DW_AT_decl_line   : 213
    <9d8>   DW_AT_decl_column : 3
    <9d9>   DW_AT_type        : <0x8e7>
 <1><9dd>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <9de>   DW_AT_encoding    : 5	(signed)
    <9df>   DW_AT_byte_size   : 2
    <9e0>   DW_AT_type        : <0x9d>
    <9e4>   DW_AT_decl_file   : 13
    <9e5>   DW_AT_decl_line   : 172
    <9e6>   DW_AT_decl_column : 15
    <9e7>   DW_AT_sibling     : <0xa1c>
 <2><9eb>: Abbrev Number: 24 (DW_TAG_enumerator)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x7ccca): osPriorityIdle
    <9f0>   DW_AT_const_value : -3
 <2><9f1>: Abbrev Number: 24 (DW_TAG_enumerator)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x8771a): osPriorityLow
    <9f6>   DW_AT_const_value : -2
 <2><9f7>: Abbrev Number: 24 (DW_TAG_enumerator)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x899de): osPriorityBelowNormal
    <9fc>   DW_AT_const_value : -1
 <2><9fd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x7581a): osPriorityNormal
    <a02>   DW_AT_const_value : 0
 <2><a03>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a04>   DW_AT_name        : (indirect string, offset: 0x2319e): osPriorityAboveNormal
    <a08>   DW_AT_const_value : 1
 <2><a09>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x1b7db): osPriorityHigh
    <a0e>   DW_AT_const_value : 2
 <2><a0f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a10>   DW_AT_name        : (indirect string, offset: 0x822f4): osPriorityRealtime
    <a14>   DW_AT_const_value : 3
 <2><a15>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a16>   DW_AT_name        : (indirect string, offset: 0x7edae): osPriorityError
    <a1a>   DW_AT_const_value : 132
 <2><a1b>: Abbrev Number: 0
 <1><a1c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x93916): osPriority
    <a21>   DW_AT_decl_file   : 13
    <a22>   DW_AT_decl_line   : 181
    <a23>   DW_AT_decl_column : 3
    <a24>   DW_AT_type        : <0x9dd>
 <1><a28>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <a29>   DW_AT_encoding    : 7	(unsigned)
    <a2a>   DW_AT_byte_size   : 4
    <a2b>   DW_AT_type        : <0x62>
    <a2f>   DW_AT_decl_file   : 13
    <a30>   DW_AT_decl_line   : 189
    <a31>   DW_AT_decl_column : 15
    <a32>   DW_AT_sibling     : <0xa94>
 <2><a36>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a37>   DW_AT_name        : (indirect string, offset: 0x7ebf3): osOK
    <a3b>   DW_AT_const_value : 0
 <2><a3c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x69810): osEventSignal
    <a41>   DW_AT_const_value : 8
 <2><a42>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a43>   DW_AT_name        : (indirect string, offset: 0xf0d): osEventMessage
    <a47>   DW_AT_const_value : 16
 <2><a48>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x5c048): osEventMail
    <a4d>   DW_AT_const_value : 32
 <2><a4e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x1813f): osEventTimeout
    <a53>   DW_AT_const_value : 64
 <2><a54>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0x25353): osErrorParameter
    <a59>   DW_AT_const_value : 128
 <2><a5a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x5e094): osErrorResource
    <a5f>   DW_AT_const_value : 129
 <2><a60>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0x639e6): osErrorTimeoutResource
    <a65>   DW_AT_const_value : 193
 <2><a66>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a67>   DW_AT_name        : (indirect string, offset: 0x2699c): osErrorISR
    <a6b>   DW_AT_const_value : 130
 <2><a6c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x132d2): osErrorISRRecursive
    <a71>   DW_AT_const_value : 131
 <2><a72>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x8cf0): osErrorPriority
    <a77>   DW_AT_const_value : 132
 <2><a78>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a79>   DW_AT_name        : (indirect string, offset: 0x189fb): osErrorNoMemory
    <a7d>   DW_AT_const_value : 133
 <2><a7e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x641a5): osErrorValue
    <a83>   DW_AT_const_value : 134
 <2><a84>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a85>   DW_AT_name        : (indirect string, offset: 0x4c66b): osErrorOS
    <a89>   DW_AT_const_value : 255
 <2><a8a>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x2e289): os_status_reserved
    <a8f>   DW_AT_const_value : 0x7fffffff
 <2><a93>: Abbrev Number: 0
 <1><a94>: Abbrev Number: 3 (DW_TAG_typedef)
    <a95>   DW_AT_name        : (indirect string, offset: 0x1675a): osStatus
    <a99>   DW_AT_decl_file   : 13
    <a9a>   DW_AT_decl_line   : 205
    <a9b>   DW_AT_decl_column : 3
    <a9c>   DW_AT_type        : <0xa28>
 <1><aa0>: Abbrev Number: 3 (DW_TAG_typedef)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x4691f): os_pthread
    <aa5>   DW_AT_decl_file   : 13
    <aa6>   DW_AT_decl_line   : 228
    <aa7>   DW_AT_decl_column : 16
    <aa8>   DW_AT_type        : <0xaac>
 <1><aac>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <aad>   DW_AT_byte_size   : 4
    <aae>   DW_AT_type        : <0xab2>
 <1><ab2>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <ab3>   DW_AT_prototyped  : 1
    <ab3>   DW_AT_sibling     : <0xabd>
 <2><ab7>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <ab8>   DW_AT_type        : <0xabd>
 <2><abc>: Abbrev Number: 0
 <1><abd>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <abe>   DW_AT_byte_size   : 4
    <abf>   DW_AT_type        : <0xac3>
 <1><ac3>: Abbrev Number: 26 (DW_TAG_const_type)
 <1><ac4>: Abbrev Number: 3 (DW_TAG_typedef)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x19be3): osThreadId
    <ac9>   DW_AT_decl_file   : 13
    <aca>   DW_AT_decl_line   : 238
    <acb>   DW_AT_decl_column : 22
    <acc>   DW_AT_type        : <0x255>
 <1><ad0>: Abbrev Number: 13 (DW_TAG_typedef)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x59ce4): osStaticThreadDef_t
    <ad5>   DW_AT_decl_file   : 13
    <ad6>   DW_AT_decl_line   : 267
    <ad8>   DW_AT_decl_column : 36
    <ad9>   DW_AT_type        : <0x248>
 <1><add>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ade>   DW_AT_name        : (indirect string, offset: 0xb46c): os_thread_def
    <ae2>   DW_AT_byte_size   : 28
    <ae3>   DW_AT_decl_file   : 13
    <ae4>   DW_AT_decl_line   : 280
    <ae6>   DW_AT_decl_column : 16
    <ae7>   DW_AT_sibling     : <0xb4e>
 <2><aeb>: Abbrev Number: 10 (DW_TAG_member)
    <aec>   DW_AT_name        : (indirect string, offset: 0x806f7): name
    <af0>   DW_AT_decl_file   : 13
    <af1>   DW_AT_decl_line   : 281
    <af3>   DW_AT_decl_column : 27
    <af4>   DW_AT_type        : <0xb4e>
    <af8>   DW_AT_data_member_location: 0
 <2><af9>: Abbrev Number: 10 (DW_TAG_member)
    <afa>   DW_AT_name        : (indirect string, offset: 0x46922): pthread
    <afe>   DW_AT_decl_file   : 13
    <aff>   DW_AT_decl_line   : 282
    <b01>   DW_AT_decl_column : 26
    <b02>   DW_AT_type        : <0xaa0>
    <b06>   DW_AT_data_member_location: 4
 <2><b07>: Abbrev Number: 10 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x684f6): tpriority
    <b0c>   DW_AT_decl_file   : 13
    <b0d>   DW_AT_decl_line   : 283
    <b0f>   DW_AT_decl_column : 26
    <b10>   DW_AT_type        : <0xa1c>
    <b14>   DW_AT_data_member_location: 8
 <2><b15>: Abbrev Number: 10 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0x3be1e): instances
    <b1a>   DW_AT_decl_file   : 13
    <b1b>   DW_AT_decl_line   : 284
    <b1d>   DW_AT_decl_column : 26
    <b1e>   DW_AT_type        : <0x106>
    <b22>   DW_AT_data_member_location: 12
 <2><b23>: Abbrev Number: 10 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0xb6e0): stacksize
    <b28>   DW_AT_decl_file   : 13
    <b29>   DW_AT_decl_line   : 285
    <b2b>   DW_AT_decl_column : 26
    <b2c>   DW_AT_type        : <0x106>
    <b30>   DW_AT_data_member_location: 16
 <2><b31>: Abbrev Number: 10 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0x2c23b): buffer
    <b36>   DW_AT_decl_file   : 13
    <b37>   DW_AT_decl_line   : 287
    <b39>   DW_AT_decl_column : 27
    <b3a>   DW_AT_type        : <0xb54>
    <b3e>   DW_AT_data_member_location: 20
 <2><b3f>: Abbrev Number: 10 (DW_TAG_member)
    <b40>   DW_AT_name        : (indirect string, offset: 0x417b6): controlblock
    <b44>   DW_AT_decl_file   : 13
    <b45>   DW_AT_decl_line   : 288
    <b47>   DW_AT_decl_column : 27
    <b48>   DW_AT_type        : <0xb5a>
    <b4c>   DW_AT_data_member_location: 24
 <2><b4d>: Abbrev Number: 0
 <1><b4e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b4f>   DW_AT_byte_size   : 4
    <b50>   DW_AT_type        : <0x267>
 <1><b54>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b55>   DW_AT_byte_size   : 4
    <b56>   DW_AT_type        : <0x106>
 <1><b5a>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b5b>   DW_AT_byte_size   : 4
    <b5c>   DW_AT_type        : <0xad0>
 <1><b60>: Abbrev Number: 13 (DW_TAG_typedef)
    <b61>   DW_AT_name        : (indirect string, offset: 0xb213): osThreadDef_t
    <b65>   DW_AT_decl_file   : 13
    <b66>   DW_AT_decl_line   : 290
    <b68>   DW_AT_decl_column : 3
    <b69>   DW_AT_type        : <0xadd>
 <1><b6d>: Abbrev Number: 5 (DW_TAG_const_type)
    <b6e>   DW_AT_type        : <0xb60>
 <1><b72>: Abbrev Number: 4 (DW_TAG_base_type)
    <b73>   DW_AT_byte_size   : 4
    <b74>   DW_AT_encoding    : 4	(float)
    <b75>   DW_AT_name        : (indirect string, offset: 0x2314): float
 <1><b79>: Abbrev Number: 4 (DW_TAG_base_type)
    <b7a>   DW_AT_byte_size   : 8
    <b7b>   DW_AT_encoding    : 4	(float)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x11775): double
 <1><b80>: Abbrev Number: 21 (DW_TAG_structure_type)
    <b81>   DW_AT_name        : (indirect string, offset: 0x5d095): MPU6050
    <b85>   DW_AT_byte_size   : 16
    <b86>   DW_AT_decl_file   : 1
    <b87>   DW_AT_decl_line   : 36
    <b88>   DW_AT_decl_column : 16
    <b89>   DW_AT_sibling     : <0xbcf>
 <2><b8d>: Abbrev Number: 20 (DW_TAG_member)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x402c1): Accel_X_RAW
    <b92>   DW_AT_decl_file   : 1
    <b93>   DW_AT_decl_line   : 38
    <b94>   DW_AT_decl_column : 10
    <b95>   DW_AT_type        : <0xe9>
    <b99>   DW_AT_data_member_location: 0
 <2><b9a>: Abbrev Number: 20 (DW_TAG_member)
    <b9b>   DW_AT_name        : (indirect string, offset: 0x6e82d): Accel_Y_RAW
    <b9f>   DW_AT_decl_file   : 1
    <ba0>   DW_AT_decl_line   : 39
    <ba1>   DW_AT_decl_column : 10
    <ba2>   DW_AT_type        : <0xe9>
    <ba6>   DW_AT_data_member_location: 2
 <2><ba7>: Abbrev Number: 20 (DW_TAG_member)
    <ba8>   DW_AT_name        : (indirect string, offset: 0xc3e9): Accel_Z_RAW
    <bac>   DW_AT_decl_file   : 1
    <bad>   DW_AT_decl_line   : 40
    <bae>   DW_AT_decl_column : 10
    <baf>   DW_AT_type        : <0xe9>
    <bb3>   DW_AT_data_member_location: 4
 <2><bb4>: Abbrev Number: 20 (DW_TAG_member)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x40f3c): Init
    <bb9>   DW_AT_decl_file   : 1
    <bba>   DW_AT_decl_line   : 44
    <bbb>   DW_AT_decl_column : 9
    <bbc>   DW_AT_type        : <0x465>
    <bc0>   DW_AT_data_member_location: 8
 <2><bc1>: Abbrev Number: 20 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x68d85): Read_Accel
    <bc6>   DW_AT_decl_file   : 1
    <bc7>   DW_AT_decl_line   : 45
    <bc8>   DW_AT_decl_column : 9
    <bc9>   DW_AT_type        : <0xbe5>
    <bcd>   DW_AT_data_member_location: 12
 <2><bce>: Abbrev Number: 0
 <1><bcf>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <bd0>   DW_AT_prototyped  : 1
    <bd0>   DW_AT_sibling     : <0xbda>
 <2><bd4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <bd5>   DW_AT_type        : <0xbda>
 <2><bd9>: Abbrev Number: 0
 <1><bda>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <bdb>   DW_AT_byte_size   : 4
    <bdc>   DW_AT_type        : <0xbe0>
 <1><be0>: Abbrev Number: 27 (DW_TAG_structure_type)
    <be1>   DW_AT_name        : (indirect string, offset: 0x2e1d2): MPU6050_t
    <be5>   DW_AT_declaration : 1
 <1><be5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <be6>   DW_AT_byte_size   : 4
    <be7>   DW_AT_type        : <0xbcf>
 <1><beb>: Abbrev Number: 3 (DW_TAG_typedef)
    <bec>   DW_AT_name        : (indirect string, offset: 0x2e1d2): MPU6050_t
    <bf0>   DW_AT_decl_file   : 1
    <bf1>   DW_AT_decl_line   : 46
    <bf2>   DW_AT_decl_column : 2
    <bf3>   DW_AT_type        : <0xb80>
 <1><bf7>: Abbrev Number: 28 (DW_TAG_structure_type)
    <bf8>   DW_AT_byte_size   : 4108
    <bfa>   DW_AT_decl_file   : 1
    <bfb>   DW_AT_decl_line   : 65
    <bfc>   DW_AT_decl_column : 9
    <bfd>   DW_AT_sibling     : <0xc39>
 <2><c01>: Abbrev Number: 20 (DW_TAG_member)
    <c02>   DW_AT_name        : (indirect string, offset: 0x2c23b): buffer
    <c06>   DW_AT_decl_file   : 1
    <c07>   DW_AT_decl_line   : 66
    <c08>   DW_AT_decl_column : 11
    <c09>   DW_AT_type        : <0xc39>
    <c0d>   DW_AT_data_member_location: 0
 <2><c0e>: Abbrev Number: 29 (DW_TAG_member)
    <c0f>   DW_AT_name        : (indirect string, offset: 0x66bbb): head
    <c13>   DW_AT_decl_file   : 1
    <c14>   DW_AT_decl_line   : 67
    <c15>   DW_AT_decl_column : 9
    <c16>   DW_AT_type        : <0x4f>
    <c1a>   DW_AT_data_member_location: 4096
 <2><c1c>: Abbrev Number: 29 (DW_TAG_member)
    <c1d>   DW_AT_name        : (indirect string, offset: 0x31219): tail
    <c21>   DW_AT_decl_file   : 1
    <c22>   DW_AT_decl_line   : 68
    <c23>   DW_AT_decl_column : 9
    <c24>   DW_AT_type        : <0x4f>
    <c28>   DW_AT_data_member_location: 4100
 <2><c2a>: Abbrev Number: 29 (DW_TAG_member)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x6a090): count
    <c2f>   DW_AT_decl_file   : 1
    <c30>   DW_AT_decl_line   : 69
    <c31>   DW_AT_decl_column : 9
    <c32>   DW_AT_type        : <0x4f>
    <c36>   DW_AT_data_member_location: 4104
 <2><c38>: Abbrev Number: 0
 <1><c39>: Abbrev Number: 11 (DW_TAG_array_type)
    <c3a>   DW_AT_type        : <0x106>
    <c3e>   DW_AT_sibling     : <0xc4a>
 <2><c42>: Abbrev Number: 30 (DW_TAG_subrange_type)
    <c43>   DW_AT_type        : <0x62>
    <c47>   DW_AT_upper_bound : 1023
 <2><c49>: Abbrev Number: 0
 <1><c4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x70c6c): CircularBuffer
    <c4f>   DW_AT_decl_file   : 1
    <c50>   DW_AT_decl_line   : 70
    <c51>   DW_AT_decl_column : 3
    <c52>   DW_AT_type        : <0xbf7>
 <1><c56>: Abbrev Number: 31 (DW_TAG_variable)
    <c57>   DW_AT_name        : (indirect string, offset: 0x73f34): input
    <c5b>   DW_AT_decl_file   : 1
    <c5c>   DW_AT_decl_line   : 80
    <c5d>   DW_AT_decl_column : 10
    <c5e>   DW_AT_type        : <0xc39>
    <c62>   DW_AT_external    : 1
    <c62>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c68>: Abbrev Number: 31 (DW_TAG_variable)
    <c69>   DW_AT_name        : (indirect string, offset: 0x79658): output
    <c6d>   DW_AT_decl_file   : 1
    <c6e>   DW_AT_decl_line   : 80
    <c6f>   DW_AT_decl_column : 22
    <c70>   DW_AT_type        : <0xc39>
    <c74>   DW_AT_external    : 1
    <c74>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><c7a>: Abbrev Number: 11 (DW_TAG_array_type)
    <c7b>   DW_AT_type        : <0x106>
    <c7f>   DW_AT_sibling     : <0xc8b>
 <2><c83>: Abbrev Number: 30 (DW_TAG_subrange_type)
    <c84>   DW_AT_type        : <0x62>
    <c88>   DW_AT_upper_bound : 511
 <2><c8a>: Abbrev Number: 0
 <1><c8b>: Abbrev Number: 32 (DW_TAG_variable)
    <c8c>   DW_AT_name        : Mag
    <c90>   DW_AT_decl_file   : 1
    <c91>   DW_AT_decl_line   : 80
    <c92>   DW_AT_decl_column : 35
    <c93>   DW_AT_type        : <0xc7a>
    <c97>   DW_AT_external    : 1
    <c97>   DW_AT_location    : 5 byte block: 3 90 10 0 20 	(DW_OP_addr: 20001090)
 <1><c9d>: Abbrev Number: 31 (DW_TAG_variable)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x5b1e2): newArray
    <ca2>   DW_AT_decl_file   : 1
    <ca3>   DW_AT_decl_line   : 81
    <ca4>   DW_AT_decl_column : 10
    <ca5>   DW_AT_type        : <0xc39>
    <ca9>   DW_AT_external    : 1
    <ca9>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><caf>: Abbrev Number: 33 (DW_TAG_variable)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x3ce4): hi2c2
    <cb4>   DW_AT_decl_file   : 1
    <cb5>   DW_AT_decl_line   : 83
    <cb6>   DW_AT_decl_column : 26
    <cb7>   DW_AT_type        : <0x7f8>
    <cbb>   DW_AT_external    : 1
    <cbb>   DW_AT_declaration : 1
 <1><cbb>: Abbrev Number: 33 (DW_TAG_variable)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x4d065): huart1
    <cc0>   DW_AT_decl_file   : 1
    <cc1>   DW_AT_decl_line   : 84
    <cc2>   DW_AT_decl_column : 27
    <cc3>   DW_AT_type        : <0x9d1>
    <cc7>   DW_AT_external    : 1
    <cc7>   DW_AT_declaration : 1
 <1><cc7>: Abbrev Number: 31 (DW_TAG_variable)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x394a0): defaultTaskHandle
    <ccc>   DW_AT_decl_file   : 1
    <ccd>   DW_AT_decl_line   : 86
    <cce>   DW_AT_decl_column : 12
    <ccf>   DW_AT_type        : <0xac4>
    <cd3>   DW_AT_external    : 1
    <cd3>   DW_AT_location    : 5 byte block: 3 90 18 0 20 	(DW_OP_addr: 20001890)
 <1><cd9>: Abbrev Number: 34 (DW_TAG_variable)
    <cda>   DW_AT_name        : (indirect string, offset: 0x4bdfc): xIdleTaskTCBBuffer
    <cde>   DW_AT_decl_file   : 1
    <cdf>   DW_AT_decl_line   : 276
    <ce1>   DW_AT_decl_column : 21
    <ce2>   DW_AT_type        : <0x248>
    <ce6>   DW_AT_location    : 5 byte block: 3 94 18 0 20 	(DW_OP_addr: 20001894)
 <1><cec>: Abbrev Number: 11 (DW_TAG_array_type)
    <ced>   DW_AT_type        : <0x119>
    <cf1>   DW_AT_sibling     : <0xcfc>
 <2><cf5>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <cf6>   DW_AT_type        : <0x62>
    <cfa>   DW_AT_upper_bound : 127
 <2><cfb>: Abbrev Number: 0
 <1><cfc>: Abbrev Number: 34 (DW_TAG_variable)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x35de0): xIdleStack
    <d01>   DW_AT_decl_file   : 1
    <d02>   DW_AT_decl_line   : 277
    <d04>   DW_AT_decl_column : 20
    <d05>   DW_AT_type        : <0xcec>
    <d09>   DW_AT_location    : 5 byte block: 3 e8 18 0 20 	(DW_OP_addr: 200018e8)
 <1><d0f>: Abbrev Number: 35 (DW_TAG_subprogram)
    <d10>   DW_AT_external    : 1
    <d10>   DW_AT_name        : (indirect string, offset: 0x76084): osDelay
    <d14>   DW_AT_decl_file   : 13
    <d15>   DW_AT_decl_line   : 478
    <d17>   DW_AT_decl_column : 10
    <d18>   DW_AT_prototyped  : 1
    <d18>   DW_AT_type        : <0xa94>
    <d1c>   DW_AT_declaration : 1
    <d1c>   DW_AT_sibling     : <0xd26>
 <2><d20>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d21>   DW_AT_type        : <0x106>
 <2><d25>: Abbrev Number: 0
 <1><d26>: Abbrev Number: 36 (DW_TAG_subprogram)
    <d27>   DW_AT_external    : 1
    <d27>   DW_AT_name        : (indirect string, offset: 0x12ee9): free
    <d2b>   DW_AT_decl_file   : 14
    <d2c>   DW_AT_decl_line   : 94
    <d2d>   DW_AT_decl_column : 6
    <d2e>   DW_AT_prototyped  : 1
    <d2e>   DW_AT_declaration : 1
    <d2e>   DW_AT_sibling     : <0xd38>
 <2><d32>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d33>   DW_AT_type        : <0x117>
 <2><d37>: Abbrev Number: 0
 <1><d38>: Abbrev Number: 37 (DW_TAG_subprogram)
    <d39>   DW_AT_external    : 1
    <d39>   DW_AT_name        : (indirect string, offset: 0x663f): cr4_fft_1024_stm32
    <d3d>   DW_AT_decl_file   : 1
    <d3e>   DW_AT_decl_line   : 394
    <d40>   DW_AT_decl_column : 5
    <d41>   DW_AT_type        : <0x4f>
    <d45>   DW_AT_declaration : 1
    <d45>   DW_AT_sibling     : <0xd4b>
 <2><d49>: Abbrev Number: 38 (DW_TAG_unspecified_parameters)
 <2><d4a>: Abbrev Number: 0
 <1><d4b>: Abbrev Number: 39 (DW_TAG_subprogram)
    <d4c>   DW_AT_external    : 1
    <d4c>   DW_AT_name        : (indirect string, offset: 0x7b2cf): calloc
    <d50>   DW_AT_decl_file   : 14
    <d51>   DW_AT_decl_line   : 90
    <d52>   DW_AT_decl_column : 7
    <d53>   DW_AT_prototyped  : 1
    <d53>   DW_AT_type        : <0x117>
    <d57>   DW_AT_declaration : 1
    <d57>   DW_AT_sibling     : <0xd66>
 <2><d5b>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d5c>   DW_AT_type        : <0x56>
 <2><d60>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d61>   DW_AT_type        : <0x56>
 <2><d65>: Abbrev Number: 0
 <1><d66>: Abbrev Number: 39 (DW_TAG_subprogram)
    <d67>   DW_AT_external    : 1
    <d67>   DW_AT_name        : (indirect string, offset: 0x35096): sqrt
    <d6b>   DW_AT_decl_file   : 15
    <d6c>   DW_AT_decl_line   : 112
    <d6d>   DW_AT_decl_column : 15
    <d6e>   DW_AT_prototyped  : 1
    <d6e>   DW_AT_type        : <0xb79>
    <d72>   DW_AT_declaration : 1
    <d72>   DW_AT_sibling     : <0xd7c>
 <2><d76>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d77>   DW_AT_type        : <0xb79>
 <2><d7b>: Abbrev Number: 0
 <1><d7c>: Abbrev Number: 35 (DW_TAG_subprogram)
    <d7d>   DW_AT_external    : 1
    <d7d>   DW_AT_name        : (indirect string, offset: 0x36822): osThreadCreate
    <d81>   DW_AT_decl_file   : 13
    <d82>   DW_AT_decl_line   : 441
    <d84>   DW_AT_decl_column : 12
    <d85>   DW_AT_prototyped  : 1
    <d85>   DW_AT_type        : <0xac4>
    <d89>   DW_AT_declaration : 1
    <d89>   DW_AT_sibling     : <0xd98>
 <2><d8d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d8e>   DW_AT_type        : <0xd98>
 <2><d92>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d93>   DW_AT_type        : <0x117>
 <2><d97>: Abbrev Number: 0
 <1><d98>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d99>   DW_AT_byte_size   : 4
    <d9a>   DW_AT_type        : <0xb6d>
 <1><d9e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <d9f>   DW_AT_external    : 1
    <d9f>   DW_AT_name        : (indirect string, offset: 0x714f6): sqrtf
    <da3>   DW_AT_decl_file   : 15
    <da4>   DW_AT_decl_line   : 376
    <da6>   DW_AT_decl_column : 14
    <da7>   DW_AT_prototyped  : 1
    <da7>   DW_AT_type        : <0xb72>
    <dab>   DW_AT_declaration : 1
    <dab>   DW_AT_sibling     : <0xdb5>
 <2><daf>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <db0>   DW_AT_type        : <0xb72>
 <2><db4>: Abbrev Number: 0
 <1><db5>: Abbrev Number: 35 (DW_TAG_subprogram)
    <db6>   DW_AT_external    : 1
    <db6>   DW_AT_name        : (indirect string, offset: 0x2f75b): HAL_UART_Transmit
    <dba>   DW_AT_decl_file   : 12
    <dbb>   DW_AT_decl_line   : 749
    <dbd>   DW_AT_decl_column : 19
    <dbe>   DW_AT_prototyped  : 1
    <dbe>   DW_AT_type        : <0x431>
    <dc2>   DW_AT_declaration : 1
    <dc2>   DW_AT_sibling     : <0xddb>
 <2><dc6>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <dc7>   DW_AT_type        : <0xddb>
 <2><dcb>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <dcc>   DW_AT_type        : <0x9cb>
 <2><dd0>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <dd1>   DW_AT_type        : <0xf5>
 <2><dd5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <dd6>   DW_AT_type        : <0x106>
 <2><dda>: Abbrev Number: 0
 <1><ddb>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ddc>   DW_AT_byte_size   : 4
    <ddd>   DW_AT_type        : <0x9d1>
 <1><de1>: Abbrev Number: 39 (DW_TAG_subprogram)
    <de2>   DW_AT_external    : 1
    <de2>   DW_AT_name        : (indirect string, offset: 0x30dd4): strlen
    <de6>   DW_AT_decl_file   : 16
    <de7>   DW_AT_decl_line   : 41
    <de8>   DW_AT_decl_column : 9
    <de9>   DW_AT_prototyped  : 1
    <de9>   DW_AT_type        : <0x56>
    <ded>   DW_AT_declaration : 1
    <ded>   DW_AT_sibling     : <0xdf7>
 <2><df1>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <df2>   DW_AT_type        : <0x261>
 <2><df6>: Abbrev Number: 0
 <1><df7>: Abbrev Number: 39 (DW_TAG_subprogram)
    <df8>   DW_AT_external    : 1
    <df8>   DW_AT_name        : (indirect string, offset: 0x7e164): sprintf
    <dfc>   DW_AT_decl_file   : 17
    <dfd>   DW_AT_decl_line   : 244
    <dfe>   DW_AT_decl_column : 5
    <dff>   DW_AT_prototyped  : 1
    <dff>   DW_AT_type        : <0x4f>
    <e03>   DW_AT_declaration : 1
    <e03>   DW_AT_sibling     : <0xe13>
 <2><e07>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e08>   DW_AT_type        : <0xb4e>
 <2><e0c>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e0d>   DW_AT_type        : <0x261>
 <2><e11>: Abbrev Number: 38 (DW_TAG_unspecified_parameters)
 <2><e12>: Abbrev Number: 0
 <1><e13>: Abbrev Number: 35 (DW_TAG_subprogram)
    <e14>   DW_AT_external    : 1
    <e14>   DW_AT_name        : (indirect string, offset: 0x1039b): HAL_I2C_Mem_Write
    <e18>   DW_AT_decl_file   : 11
    <e19>   DW_AT_decl_line   : 567
    <e1b>   DW_AT_decl_column : 19
    <e1c>   DW_AT_prototyped  : 1
    <e1c>   DW_AT_type        : <0x431>
    <e20>   DW_AT_declaration : 1
    <e20>   DW_AT_sibling     : <0xe48>
 <2><e24>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e25>   DW_AT_type        : <0xe48>
 <2><e29>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e2a>   DW_AT_type        : <0xf5>
 <2><e2e>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e2f>   DW_AT_type        : <0xf5>
 <2><e33>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e34>   DW_AT_type        : <0xf5>
 <2><e38>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e39>   DW_AT_type        : <0x13d>
 <2><e3d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e3e>   DW_AT_type        : <0xf5>
 <2><e42>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e43>   DW_AT_type        : <0x106>
 <2><e47>: Abbrev Number: 0
 <1><e48>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e49>   DW_AT_byte_size   : 4
    <e4a>   DW_AT_type        : <0x7f8>
 <1><e4e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <e4f>   DW_AT_external    : 1
    <e4f>   DW_AT_name        : (indirect string, offset: 0x7333b): HAL_I2C_Mem_Read
    <e53>   DW_AT_decl_file   : 11
    <e54>   DW_AT_decl_line   : 568
    <e56>   DW_AT_decl_column : 19
    <e57>   DW_AT_prototyped  : 1
    <e57>   DW_AT_type        : <0x431>
    <e5b>   DW_AT_declaration : 1
    <e5b>   DW_AT_sibling     : <0xe83>
 <2><e5f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e60>   DW_AT_type        : <0xe48>
 <2><e64>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e65>   DW_AT_type        : <0xf5>
 <2><e69>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e6a>   DW_AT_type        : <0xf5>
 <2><e6e>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e6f>   DW_AT_type        : <0xf5>
 <2><e73>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e74>   DW_AT_type        : <0x13d>
 <2><e78>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e79>   DW_AT_type        : <0xf5>
 <2><e7d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e7e>   DW_AT_type        : <0x106>
 <2><e82>: Abbrev Number: 0
 <1><e83>: Abbrev Number: 40 (DW_TAG_subprogram)
    <e84>   DW_AT_external    : 1
    <e84>   DW_AT_name        : (indirect string, offset: 0x3977c): HAL_Delay
    <e88>   DW_AT_decl_file   : 18
    <e89>   DW_AT_decl_line   : 296
    <e8b>   DW_AT_decl_column : 6
    <e8c>   DW_AT_prototyped  : 1
    <e8c>   DW_AT_declaration : 1
    <e8c>   DW_AT_sibling     : <0xe96>
 <2><e90>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <e91>   DW_AT_type        : <0x106>
 <2><e95>: Abbrev Number: 0
 <1><e96>: Abbrev Number: 41 (DW_TAG_subprogram)
    <e97>   DW_AT_external    : 1
    <e97>   DW_AT_name        : (indirect string, offset: 0x1fcb4): StartDefaultTask
    <e9b>   DW_AT_decl_file   : 1
    <e9c>   DW_AT_decl_line   : 332
    <e9e>   DW_AT_decl_column : 6
    <e9f>   DW_AT_prototyped  : 1
    <e9f>   DW_AT_low_pc      : 0x80026a8
    <ea3>   DW_AT_high_pc     : 0x1dc
    <ea7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ea9>   DW_AT_GNU_all_tail_call_sites: 1
    <ea9>   DW_AT_sibling     : <0xf71>
 <2><ead>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <eae>   DW_AT_name        : (indirect string, offset: 0x1e8c2): argument
    <eb2>   DW_AT_decl_file   : 1
    <eb3>   DW_AT_decl_line   : 332
    <eb5>   DW_AT_decl_column : 36
    <eb6>   DW_AT_type        : <0xabd>
    <eba>   DW_AT_location    : 3 byte block: 91 8c 5f 	(DW_OP_fbreg: -4212)
 <2><ebe>: Abbrev Number: 34 (DW_TAG_variable)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x2c23b): buffer
    <ec3>   DW_AT_decl_file   : 1
    <ec4>   DW_AT_decl_line   : 335
    <ec6>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0xc4a>
    <ecb>   DW_AT_location    : 3 byte block: 91 d4 5f 	(DW_OP_fbreg: -4140)
 <2><ecf>: Abbrev Number: 43 (DW_TAG_variable)
    <ed0>   DW_AT_name        : str
    <ed4>   DW_AT_decl_file   : 1
    <ed5>   DW_AT_decl_line   : 338
    <ed7>   DW_AT_decl_column : 9
    <ed8>   DW_AT_type        : <0xf71>
    <edc>   DW_AT_location    : 3 byte block: 91 a0 5f 	(DW_OP_fbreg: -4192)
 <2><ee0>: Abbrev Number: 44 (DW_TAG_variable)
    <ee1>   DW_AT_name        : len
    <ee5>   DW_AT_decl_file   : 1
    <ee6>   DW_AT_decl_line   : 339
    <ee8>   DW_AT_decl_column : 8
    <ee9>   DW_AT_type        : <0x4f>
 <2><eed>: Abbrev Number: 45 (DW_TAG_variable)
    <eee>   DW_AT_name        : (indirect string, offset: 0x645c9): total_g
    <ef2>   DW_AT_decl_file   : 1
    <ef3>   DW_AT_decl_line   : 340
    <ef5>   DW_AT_decl_column : 10
    <ef6>   DW_AT_type        : <0xb72>
 <2><efa>: Abbrev Number: 34 (DW_TAG_variable)
    <efb>   DW_AT_name        : (indirect string, offset: 0x8a7a1): total_acc_16384
    <eff>   DW_AT_decl_file   : 1
    <f00>   DW_AT_decl_line   : 341
    <f02>   DW_AT_decl_column : 13
    <f03>   DW_AT_type        : <0x106>
    <f07>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><f0a>: Abbrev Number: 34 (DW_TAG_variable)
    <f0b>   DW_AT_name        : (indirect string, offset: 0xc20e): arrayindex
    <f0f>   DW_AT_decl_file   : 1
    <f10>   DW_AT_decl_line   : 342
    <f12>   DW_AT_decl_column : 13
    <f13>   DW_AT_type        : <0xf5>
    <f17>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><f1a>: Abbrev Number: 34 (DW_TAG_variable)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x4b17): imu1
    <f1f>   DW_AT_decl_file   : 1
    <f20>   DW_AT_decl_line   : 344
    <f22>   DW_AT_decl_column : 14
    <f23>   DW_AT_type        : <0xbeb>
    <f27>   DW_AT_location    : 3 byte block: 91 90 5f 	(DW_OP_fbreg: -4208)
 <2><f2b>: Abbrev Number: 46 (DW_TAG_lexical_block)
    <f2c>   DW_AT_low_pc      : 0x80027a6
    <f30>   DW_AT_high_pc     : 0xc0
 <3><f34>: Abbrev Number: 34 (DW_TAG_variable)
    <f35>   DW_AT_name        : (indirect string, offset: 0x5b1e2): newArray
    <f39>   DW_AT_decl_file   : 1
    <f3a>   DW_AT_decl_line   : 380
    <f3c>   DW_AT_decl_column : 14
    <f3d>   DW_AT_type        : <0xb54>
    <f41>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><f44>: Abbrev Number: 37 (DW_TAG_subprogram)
    <f45>   DW_AT_external    : 1
    <f45>   DW_AT_name        : (indirect string, offset: 0x663f): cr4_fft_1024_stm32
    <f49>   DW_AT_decl_file   : 1
    <f4a>   DW_AT_decl_line   : 394
    <f4c>   DW_AT_decl_column : 5
    <f4d>   DW_AT_type        : <0x4f>
    <f51>   DW_AT_declaration : 1
    <f51>   DW_AT_sibling     : <0xf57>
 <4><f55>: Abbrev Number: 38 (DW_TAG_unspecified_parameters)
 <4><f56>: Abbrev Number: 0
 <3><f57>: Abbrev Number: 46 (DW_TAG_lexical_block)
    <f58>   DW_AT_low_pc      : 0x80027fc
    <f5c>   DW_AT_high_pc     : 0x5e
 <4><f60>: Abbrev Number: 43 (DW_TAG_variable)
    <f61>   DW_AT_name        : i
    <f63>   DW_AT_decl_file   : 1
    <f64>   DW_AT_decl_line   : 402
    <f66>   DW_AT_decl_column : 13
    <f67>   DW_AT_type        : <0x4f>
    <f6b>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24) [without DW_AT_frame_base]
 <4><f6e>: Abbrev Number: 0
 <3><f6f>: Abbrev Number: 0
 <2><f70>: Abbrev Number: 0
 <1><f71>: Abbrev Number: 11 (DW_TAG_array_type)
    <f72>   DW_AT_type        : <0x267>
    <f76>   DW_AT_sibling     : <0xf81>
 <2><f7a>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <f7b>   DW_AT_type        : <0x62>
    <f7f>   DW_AT_upper_bound : 49
 <2><f80>: Abbrev Number: 0
 <1><f81>: Abbrev Number: 41 (DW_TAG_subprogram)
    <f82>   DW_AT_external    : 1
    <f82>   DW_AT_name        : (indirect string, offset: 0x215d1): MX_FREERTOS_Init
    <f86>   DW_AT_decl_file   : 1
    <f87>   DW_AT_decl_line   : 293
    <f89>   DW_AT_decl_column : 6
    <f8a>   DW_AT_prototyped  : 1
    <f8a>   DW_AT_low_pc      : 0x8002670
    <f8e>   DW_AT_high_pc     : 0x38
    <f92>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f94>   DW_AT_GNU_all_tail_call_sites: 1
    <f94>   DW_AT_sibling     : <0xfa9>
 <2><f98>: Abbrev Number: 34 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0x6c486): os_thread_def_defaultTask
    <f9d>   DW_AT_decl_file   : 1
    <f9e>   DW_AT_decl_line   : 316
    <fa0>   DW_AT_decl_column : 3
    <fa1>   DW_AT_type        : <0xb6d>
    <fa5>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><fa8>: Abbrev Number: 0
 <1><fa9>: Abbrev Number: 47 (DW_TAG_subprogram)
    <faa>   DW_AT_external    : 1
    <faa>   DW_AT_name        : (indirect string, offset: 0x8bcd2): vApplicationGetIdleTaskMemory
    <fae>   DW_AT_decl_file   : 1
    <faf>   DW_AT_decl_line   : 279
    <fb1>   DW_AT_decl_column : 6
    <fb2>   DW_AT_prototyped  : 1
    <fb2>   DW_AT_low_pc      : 0x8002640
    <fb6>   DW_AT_high_pc     : 0x30
    <fba>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fbc>   DW_AT_GNU_all_call_sites: 1
    <fbc>   DW_AT_sibling     : <0xff1>
 <2><fc0>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x4bdfa): ppxIdleTaskTCBBuffer
    <fc5>   DW_AT_decl_file   : 1
    <fc6>   DW_AT_decl_line   : 279
    <fc8>   DW_AT_decl_column : 52
    <fc9>   DW_AT_type        : <0xff1>
    <fcd>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fd0>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x52c97): ppxIdleTaskStackBuffer
    <fd5>   DW_AT_decl_file   : 1
    <fd6>   DW_AT_decl_line   : 279
    <fd8>   DW_AT_decl_column : 88
    <fd9>   DW_AT_type        : <0xffd>
    <fdd>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><fe0>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <fe1>   DW_AT_name        : (indirect string, offset: 0x4e9bd): pulIdleTaskStackSize
    <fe5>   DW_AT_decl_file   : 1
    <fe6>   DW_AT_decl_line   : 279
    <fe8>   DW_AT_decl_column : 122
    <fe9>   DW_AT_type        : <0xb54>
    <fed>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ff0>: Abbrev Number: 0
 <1><ff1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ff2>   DW_AT_byte_size   : 4
    <ff3>   DW_AT_type        : <0xff7>
 <1><ff7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ff8>   DW_AT_byte_size   : 4
    <ff9>   DW_AT_type        : <0x248>
 <1><ffd>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ffe>   DW_AT_byte_size   : 4
    <fff>   DW_AT_type        : <0x273>
 <1><1003>: Abbrev Number: 41 (DW_TAG_subprogram)
    <1004>   DW_AT_external    : 1
    <1004>   DW_AT_name        : (indirect string, offset: 0x56f2c): vApplicationMallocFailedHook
    <1008>   DW_AT_decl_file   : 1
    <1009>   DW_AT_decl_line   : 257
    <100b>   DW_AT_decl_column : 13
    <100c>   DW_AT_prototyped  : 1
    <100c>   DW_AT_low_pc      : 0x8002608
    <1010>   DW_AT_high_pc     : 0x38
    <1014>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1016>   DW_AT_GNU_all_tail_call_sites: 1
    <1016>   DW_AT_sibling     : <0x102b>
 <2><101a>: Abbrev Number: 43 (DW_TAG_variable)
    <101b>   DW_AT_name        : str
    <101f>   DW_AT_decl_file   : 1
    <1020>   DW_AT_decl_line   : 269
    <1022>   DW_AT_decl_column : 7
    <1023>   DW_AT_type        : <0xf71>
    <1027>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><102a>: Abbrev Number: 0
 <1><102b>: Abbrev Number: 48 (DW_TAG_subprogram)
    <102c>   DW_AT_external    : 1
    <102c>   DW_AT_name        : (indirect string, offset: 0x343d9): vApplicationStackOverflowHook
    <1030>   DW_AT_decl_file   : 1
    <1031>   DW_AT_decl_line   : 245
    <1032>   DW_AT_decl_column : 13
    <1033>   DW_AT_prototyped  : 1
    <1033>   DW_AT_low_pc      : 0x80025c4
    <1037>   DW_AT_high_pc     : 0x44
    <103b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <103d>   DW_AT_GNU_all_tail_call_sites: 1
    <103d>   DW_AT_sibling     : <0x1071>
 <2><1041>: Abbrev Number: 49 (DW_TAG_formal_parameter)
    <1042>   DW_AT_name        : (indirect string, offset: 0x67f80): xTask
    <1046>   DW_AT_decl_file   : 1
    <1047>   DW_AT_decl_line   : 245
    <1048>   DW_AT_decl_column : 55
    <1049>   DW_AT_type        : <0x255>
    <104d>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><1051>: Abbrev Number: 49 (DW_TAG_formal_parameter)
    <1052>   DW_AT_name        : (indirect string, offset: 0x3120e): pcTaskName
    <1056>   DW_AT_decl_file   : 1
    <1057>   DW_AT_decl_line   : 245
    <1058>   DW_AT_decl_column : 75
    <1059>   DW_AT_type        : <0x1071>
    <105d>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><1061>: Abbrev Number: 50 (DW_TAG_variable)
    <1062>   DW_AT_name        : str
    <1066>   DW_AT_decl_file   : 1
    <1067>   DW_AT_decl_line   : 250
    <1068>   DW_AT_decl_column : 7
    <1069>   DW_AT_type        : <0xf71>
    <106d>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><1070>: Abbrev Number: 0
 <1><1071>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <1072>   DW_AT_byte_size   : 4
    <1073>   DW_AT_type        : <0x77>
 <1><1077>: Abbrev Number: 48 (DW_TAG_subprogram)
    <1078>   DW_AT_external    : 1
    <1078>   DW_AT_name        : (indirect string, offset: 0x31ced): copyCircularBufferToArray
    <107c>   DW_AT_decl_file   : 1
    <107d>   DW_AT_decl_line   : 221
    <107e>   DW_AT_decl_column : 6
    <107f>   DW_AT_prototyped  : 1
    <107f>   DW_AT_low_pc      : 0x8002586
    <1083>   DW_AT_high_pc     : 0x3e
    <1087>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1089>   DW_AT_GNU_all_tail_call_sites: 1
    <1089>   DW_AT_sibling     : <0x10c7>
 <2><108d>: Abbrev Number: 51 (DW_TAG_formal_parameter)
    <108e>   DW_AT_name        : cb
    <1091>   DW_AT_decl_file   : 1
    <1092>   DW_AT_decl_line   : 221
    <1093>   DW_AT_decl_column : 48
    <1094>   DW_AT_type        : <0x10c7>
    <1098>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><109b>: Abbrev Number: 49 (DW_TAG_formal_parameter)
    <109c>   DW_AT_name        : (indirect string, offset: 0x1def1): array
    <10a0>   DW_AT_decl_file   : 1
    <10a1>   DW_AT_decl_line   : 221
    <10a2>   DW_AT_decl_column : 62
    <10a3>   DW_AT_type        : <0xb54>
    <10a7>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><10aa>: Abbrev Number: 49 (DW_TAG_formal_parameter)
    <10ab>   DW_AT_name        : (indirect string, offset: 0xb6e5): size
    <10af>   DW_AT_decl_file   : 1
    <10b0>   DW_AT_decl_line   : 221
    <10b1>   DW_AT_decl_column : 73
    <10b2>   DW_AT_type        : <0x4f>
    <10b6>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><10b9>: Abbrev Number: 50 (DW_TAG_variable)
    <10ba>   DW_AT_name        : i
    <10bc>   DW_AT_decl_file   : 1
    <10bd>   DW_AT_decl_line   : 223
